[{"key": "Scope", "numbering": "1", "title_level": 0, "desc": "         1  Scope\n\nThe present document provides an overview of the multi-connectivity\noperation using E-UTRA and NR radio access technologies. Details of the\nnetwork and radio interface protocols are specified in companion\nspecifications of the 36 and 38 series.\n\n\n", "Keywords": "None"}, {"key": "References", "numbering": "2", "title_level": 0, "desc": "2  References\n\nThe following documents contain provisions which, through reference in this\ntext, constitute provisions of the present document.\n\n  -  References are either specific (identified by date of publication,\n    edition number, version number, etc.) or non-specific.\n\n  -  For a specific reference, subsequent revisions do not apply.\n\n  -  For a non-specific reference, the latest version applies. In the case\n    of a reference to a 3GPP document (including a GSM document), a non-\n    specific reference implicitly refers to the latest version of that\n    document in the same Release as the present document.\n\n  [1]  3GPP TR 21.905: \"Vocabulary for 3GPP Specifications\".\n\n  [2]  3GPP TS 36.300: \"Evolved Universal Terrestrial Radio Access (E-UTRA)\n             and Evolved Universal Terrestrial Radio Access Network (E-\n             UTRAN); Overall description; Stage 2\".\n\n  [3]  3GPP TS 38.300: \"NR; NR and NG-RAN Overall description; Stage 2\".\n\n  [4]  3GPP TS 38.331: \"NR; Radio Resource Control (RRC) protocol\n             specification\".\n\n  [5]  3GPP TS 38.423: \"NG-RAN; Xn application protocol (XnAP)\".\n\n  [6]  3GPP TS 38.425: \"NG-RAN; NR user plane protocol\".\n\n  [7]  3GPP TS 38.401: \"NG-RAN; Architecture description\".\n\n\n", "Keywords": "None"}, {"key": "Definitions, symbols and abbreviations", "numbering": "3", "title_level": 0, "desc": "3  Definitions, symbols and abbreviations\n\n\n", "Keywords": "None"}, {"key": "Multi-RAT Dual Connectivity", "numbering": "4", "title_level": 0, "desc": "4  Multi-RAT Dual Connectivity\n\n\n", "Keywords": "None"}, {"key": "General", "numbering": "4.1", "title_level": 1, "desc": "4.1  General\n\n\n", "Keywords": "None"}, {"key": "Common MR-DC principles", "numbering": "4.1.1", "title_level": 2, "desc": "4.1.1  Common MR-DC principles\n\nMulti-RAT Dual Connectivity (MR-DC) is a generalization of the Intra-E-UTRA\nDual Connectivity (DC) described in 36.300 [2], where a multiple Rx/Tx UE\nmay be configured to utilise resources provided by two different nodes\nconnected via non-ideal backhaul, one providing E-UTRA access and the other\none providing NR access. One node acts as the MN and the other as the SN.\nThe MN and SN are connected via a network interface and at least the MN is\nconnected to the core network.\n\n  NOTE 1:  MR-DC is designed based on the assumption of non-ideal backhaul\n         between the different nodes but can also be used in case of ideal\n         backhaul.\n\n  NOTE 2:  All MR-DC normative text and procedures in this version of the\n         specification show the aggregated node case. The details about non-\n         aggregated node for MR-DC operation are described in TS38.401[7].\n\n\n", "Keywords": "None"}, {"key": "MR-DC with the EPC", "numbering": "4.1.2", "title_level": 2, "desc": "4.1.2  MR-DC with the EPC\n\nE-UTRAN supports MR-DC via E-UTRA-NR Dual Connectivity (EN-DC), in which a\nUE is connected to one eNB that acts as a MN and one en-gNB that acts as a\nSN. The eNB is connected to the EPC via the S1 interface and to the en-gNB\nvia the X2 interface. The en-gNB might also be connected to the EPC via the\nS1-U interface and other en-gNBs via the X2-U interface.\n\nThe EN-DC architecture is illustrated in Figure 4.1.2-1 below.\n\n                                    [pic]\n\n                 Figure 4.1.2-1: EN-DC Overall Architecture\n\n\n", "Keywords": "None"}, {"key": "MR-DC with the 5GC", "numbering": "4.1.3", "title_level": 2, "desc": "4.1.3  MR-DC with the 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\n\n", "Keywords": "None"}, {"key": "E-UTRA-NR Dual Connectivity", "numbering": "4.1.3.1", "title_level": 3, "desc": "4.1.3.1  E-UTRA-NR Dual Connectivity\n\nNG-RAN supports NG-RAN E-UTRA-NR Dual Connectivity (NGEN-DC), in which a UE\nis connected to one ng-eNB that acts as a MN and one gNB that acts as a SN.\nThe ng-eNB is connected to the 5GC and the gNB is connected to the ng-eNB\nvia the Xn interface.\n\n\n", "Keywords": "None"}, {"key": "NR-E-UTRA Dual Connectivity", "numbering": "4.1.3.2", "title_level": 3, "desc": "4.1.3.2  NR-E-UTRA Dual Connectivity\n\nNG-RAN supports NR-E-UTRA Dual Connectivity (NE-DC), in which a UE is\nconnected to one gNB that acts as a MN and one ng-eNB that acts as a SN.\nThe gNB is connected to 5GC and the ng-eNB is connected to the gNB via the\nXn interface.\n\n\n", "Keywords": "None"}, {"key": "Radio Protocol Architecture", "numbering": "4.2", "title_level": 1, "desc": "4.2  Radio Protocol Architecture\n\n\n", "Keywords": "None"}, {"key": "Control Plane", "numbering": "4.2.1", "title_level": 2, "desc": "4.2.1  Control Plane\n\nIn MR-DC, the UE has a single RRC state, based on the MN RRC and a single C-\nplane connection towards the Core Network. Figure 4.2.1-1 illustrates the\nControl plane architecture for MR-DC. Each radio node has its own RRC\nentity (E-UTRA version if the node is an eNB or NR version if the node is a\ngNB) which can generate RRC PDUs to be sent to the UE.\n\nRRC PDUs generated by the SN can be transported via the MN to the UE. The\nMN always sends the initial SN RRC configuration via MCG SRB (SRB1), but\nsubsequent reconfigurations may be transported via MN or SN. When\ntransporting RRC PDU from the SN, the MN does not modify the UE\nconfiguration provided by the SN.\n\nIn EN-DC, at initial connection establishment SRB1 uses E-UTRA PDCP. After\ninitial connection establishment MCG SRBs (SRB1 and SRB2) can be configured\nby the network to use either E-UTRA PDCP or NR PDCP. A PDCP version change\n(release of old PDCP and establish of new PDCP) of SRBs can be supported in\neither direction (i.e. from E-UTRA PDCP to NR PDCP or viceversa) via a\nhandover procedure (reconfiguration with mobility) or, for the initial\nchange from E-UTRA PDCP to NR PDCP, with a reconfiguration without\nmobility, when the network knows there is no UL data in buffer and before\nthe initial security activation. For EN-DC capable UEs, NR PDCP can be\nconfigured for DRBs and SRBs also before EN-DC is configured.\n\nIf the SN is a gNB (i.e. for EN-DC and NGEN-DC), the UE can be configured\nto establish a SRB with the SN (SRB3) to enable RRC PDUs for the SN to be\nsent directly between the UE and the SN. RRC PDUs for the SN can only be\ntransported directly to the UE for SN RRC reconfiguration not requiring any\ncoordination with the MN. Measurement reporting for mobility within the SN\ncan be done directly from the UE to the SN if SRB3 is configured.\n\nSplit SRB is supported for all MR-DC options, allowing duplication of RRC\nPDUs generated by the MN, via the direct path and via the SN. Split SRB\nuses NR PDCP. This version of the specification does not support the\nduplication of RRC PDUs generated by the SN via the MN and SN paths.\n\nIn EN-DC, the SCG configuration is kept in the UE during suspension. The UE\nreleases the SCG configuration (but not the radio bearer configuration)\nduring resumption initiation.\n\n                              [pic]       [pic]\n\n Figure 4.2.1-1: Control plane architecture for EN-DC (left) and MR-DC with\n                                5GC (right).\n\n\n", "Keywords": "None"}, {"key": "User Plane", "numbering": "4.2.2", "title_level": 2, "desc": "4.2.2  User Plane\n\nIn MR-DC, from a UE perspective, three bearer types exist: MCG bearer, SCG\nbearer and split bearer. These three bearer types are depicted in Figure\n4.2.2-1 for MR-DC with EPC (EN-DC) and in Figure 4.2.2-2 for MR-DC with 5GC\n(NGEN-DC, NE-DC).\n\nFor EN-DC, the network can configure either E-UTRA PDCP or NR PDCP for MN\nterminated MCG bearers while NR PDCP is always used for all other bearers.\n\nIn MR-DC with 5GC, NR PDCP is always used for all bearer types. In NGEN-DC,\nE-UTRA RLC/MAC is used in the MN while NR RLC/MAC is used in the SN. In NE-\nDC, NR RLC/MAC is used in the MN while E-UTRA RLC/MAC is used in the SN.\n\n                                    [pic]\n\n Figure 4.2.2-1: Radio Protocol Architecture for MCG, SCG and split bearers\n               from a UE perspective in MR-DC with EPC (EN-DC)\n\n                                    [pic]\n\n Figure 4.2.2-2: Radio Protocol Architecture for MCG, SCG and split bearers\n          from a UE perspective in MR-DC with 5GC (NGEN-DC, NE-DC).\n\nFrom a network perspective, each bearer (MCG, SCG and split bearer) can be\nterminated either in MN or in SN. Network side protocol termination options\nare shown in Figure 4.2.2-3 for MR-DC with EPC (EN-DC) and in Figure 4.2.2-\n4 for MR-DC with 5GC (NGEN-DC, NE-DC).\n\n  NOTE 1:  Even if only SCG bearers are configured for a UE, for SRB1 and\n         SRB2 the logical channels are always configured at least in the\n         MCG, i.e. this is still an MR-DC configuration and a Pcell always\n         exists.\n\n  NOTE 2:  If only MCG bearers are configured for a UE, i.e. there is no\n         SCG, this is still considered an MR-DC configuration, as long as at\n         least one of the bearers is terminated in the SN.\n\n                                    [pic]\n\n Figure 4.2.2-3: Network side protocol termination options for MCG, SCG and\n                  split bearers in MR-DC with EPC (EN-DC).\n\n                                    [pic]\n\n Figure 4.2.2-4: Network side protocol termination options for MCG, SCG and\n              split bearers in MR-DC with 5GC (NGEN-DC, NE-DC).\n\n\n", "Keywords": "None"}, {"key": "Network interfaces", "numbering": "4.3", "title_level": 1, "desc": "4.3  Network interfaces\n\n\n", "Keywords": "None"}, {"key": "Control Plane", "numbering": "4.3.1", "title_level": 2, "desc": "4.3.1  Control Plane\n\n\n", "Keywords": "None"}, {"key": "Common MR-DC principles", "numbering": "4.3.1.1", "title_level": 3, "desc": "4.3.1.1  Common MR-DC principles\n\nIn MR-DC, there is an interface between the MN and the SN for control plane\nsignalling and coordination. For each MR-DC UE, there is also one control\nplane connection between the MN and a corresponding CN entity. The MN and\nthe SN involved in MR-DC for a certain UE control their radio resources and\nare primarily responsible for allocating radio resources of their cells.\n\nFigure 4.3.1.1-1 shows C-plane connectivity of MN and SN involved in MR-DC\nfor a certain UE.\n\n                                 [pic][pic]\n\n Figure 4.3.1.1-1: C-Plane connectivity for EN-DC (left) and MR-DC with 5GC\n                                  (right).\n\n\n", "Keywords": "None"}, {"key": "MR-DC with EPC", "numbering": "4.3.1.2", "title_level": 3, "desc": "4.3.1.2  MR-DC with EPC\n\nIn MR-DC with EPC (EN-DC), the involved core network entity is the MME. S1-\nMME is terminated in MN and the MN and the SN are interconnected via X2-C.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "4.3.1.3", "title_level": 3, "desc": "4.3.1.3  MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nIn MR-DC with 5GC (NGEN-DC, NE-DC), the involved core network entity is the\nAMF. NG-C is terminated in the MN and the MN and the SN are interconnected\nvia Xn-C.\n\n\n", "Keywords": "None"}, {"key": "User Plane", "numbering": "4.3.2", "title_level": 2, "desc": "4.3.2  User Plane\n\n\n", "Keywords": "None"}, {"key": "Common MR-DC principles", "numbering": "4.3.2.1", "title_level": 3, "desc": "4.3.2.1  Common MR-DC principles\n\nThere are different U-plane connectivity options of the MN and SN involved\nin MR-DC for a certain UE, as shown in Figure 4.3.2.2-1. The U-plane\nconnectivity depends on the bearer option configured:\n\n  -  For MN terminated bearers, the user plane connection to the CN entity\n    is terminated in the MN;\n\n  -  For SN terminated bearers, the user plane connection to the CN entity\n    is terminated in the SN;\n\n  -  The transport of user plane data over the Uu either involves MCG or\n    SCG radio resources or both:\n\n    -  For MCG bearers, only MCG radio resources are involved;\n\n    -  For SCG bearers, only SCG radio resources are involved;\n\n    -  For split bearers, both MCG and SCG radio resources are involved.\n\n  -  For split bearers, MN terminated SCG bearers and SN terminated MCG\n    bearers, PDCP data is transferred between the MN and the SN via the MN-\n    SN user plane interface.\n\n                                 [pic][pic]\n\n Figure 4.3.2.1-1: U-Plane connectivity for EN-DC (left) and MR-DC with 5GC\n                                  (right).\n\n\n", "Keywords": "None"}, {"key": "MR-DC with EPC", "numbering": "4.3.2.2", "title_level": 3, "desc": "4.3.2.2  MR-DC with EPC\n\nFor MR-DC with EPC (EN-DC), X2-U interface is the user plane interface\nbetween MN and SN, and S1-U is the user plane interface between the MN, the\nSN or both and the S-GW.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "4.3.2.3", "title_level": 3, "desc": "4.3.2.3  MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nFor MR-DC with 5GC (NGEN-DC, NE-DC), Xn-U interface is the user plane\ninterface between MN and SN, and NG-U is the user plane interface between\nthe MN, the SN or both and the UPF.\n\n\n", "Keywords": "None"}, {"key": "Layer 1 related aspects", "numbering": "5", "title_level": 0, "desc": "5  Layer 1 related aspects\n\nIn MR-DC, two or more Component Carriers (CCs) may be aggregated over two\ncell groups. A UE may simultaneously receive or transmit on multiple CCs\ndepending on its capabilities. The maximum number of configured CCs for a\nUE is 32 for DL and UL. Depending on UE's capabilities, up to 31 CCs can be\nconfigured for an E-UTRA cell group when the NR cell group is configured.\n\nIn EN-DC, the SN may configure the same Physical Cell ID (PCI) to more than\none NR cell it serves. To avoid PCI confusion for EN-DC, NR PCIs should be\nallocated in a way that an NR cell is uniquely identifyable by E-UTRA cell\ninformation. This E-UTRA cell is in the coverage area of an NR cell\nincluded in the EN-DC operation. In addtion, NR PCIs should only be re-used\nin NR cells on the same SSB frequency sufficiently distant from each other.\nX2-C signalling supports disambiguation of NR PCIs by including the ECGI in\nrespective X2AP EN-DC messages (e.g. SGNB ADDITION REQUEST).\n\n\n", "Keywords": "None"}, {"key": "Layer 2 related aspects", "numbering": "6", "title_level": 0, "desc": "6  Layer 2 related aspects\n\n\n", "Keywords": "None"}, {"key": "MAC Sublayer", "numbering": "6.1", "title_level": 1, "desc": "6.1  MAC Sublayer\n\nIn MR-DC, the UE is configured with two MAC entities: one MAC entity for\nthe MCG and one MAC entity for the SCG.\n\nIn MR-DC, semi-persistent scheduling (SPS) resources can be configured on\nboth Pcell and PSCell.\n\nIn MR-DC, the BSR configuration, triggering and reporting are independently\nperformed per cell group. For split bearers, the PDCP data is considered in\nBSR in the cell group(s) configured by RRC.\n\nIn EN-DC, separate DRX configurations are provided for MCG and SCG.\n\n\n", "Keywords": "None"}, {"key": "RLC Sublayer", "numbering": "6.2", "title_level": 1, "desc": "6.2  RLC Sublayer\n\nBoth RLC AM and UM can be configured for MR-DC, for all bearer types (MCG,\nSCG and split bearers).\n\n\n", "Keywords": "None"}, {"key": "PDCP Sublayer", "numbering": "6.3", "title_level": 1, "desc": "6.3  PDCP Sublayer\n\nIn EN-DC, CA packet duplication (see [3]) is not applied to CA in the MN.\n\nIn EN-DC and NGEN-DC, CA packet duplication can only be configured for SCG\nbearer. In NE-DC, CA packet duplication can only be configured for MCG\nbearer.\n\nIn EN-DC, RoHC can be configured for all the bearer types.\n\n\n", "Keywords": "None"}, {"key": "SDAP Sublayer", "numbering": "6.4", "title_level": 1, "desc": "6.4  SDAP Sublayer\n\nIn MR-DC with 5GC, the UE can be configured with two SDAP protocol entities\nfor each individual PDU session, one for MN and another one for SN (see\nsubclause 8.1).\n\n\n", "Keywords": "None"}, {"key": "RRC related aspects", "numbering": "7", "title_level": 0, "desc": "7  RRC related aspects\n\n\n", "Keywords": "None"}, {"key": "System information handling", "numbering": "7.1", "title_level": 1, "desc": "7.1  System information handling\n\nIn MR-DC, the SN is not required to broadcast system information other than\nfor radio frame timing and SFN. System information for initial\nconfiguration is provided to the UE by dedicated RRC signalling via the MN.\nThe UE acquires, at least, radio frame timing and SFN of SCG from the\nPSS/SSS and MIB (if the SN is an eNB) / NR-PSS/SSS and PBCH (if the SN is a\ngNB) of the PSCell.\n\nAdditionally, in EN-DC, upon change of the relevant system information of a\nconfigured Scell, the network releases and subsequently adds the concerned\nScell (with updated system information), via one or more RRC\nreconfiguration messages sent on SRB1 or SRB3, if configured.\n\n\n", "Keywords": "None"}, {"key": "Measurements", "numbering": "7.2", "title_level": 1, "desc": "7.2  Measurements\n\nIf the measurement is configured to the UE in preparation for the Secondary\nNode Addition procedure described in sub-clause 10.2, the Master node\nshould configure the measurement to the UE.\n\nIn case of the intra-secondary node mobility described in sub-clause 10.3,\nthe SN should configure the measurement to the UE in coordination with the\nMN, if required.\n\nThe Secondary Node Change procedure described in sub-clause 10.5 can be\ntriggered by both the MN (only for inter-frequency secondary node change)\nand the SN. For secondary node changes triggered by the SN, the RRM\nmeasurement configuration is maintained by the SN which also processes the\nmeasurement reporting, without providing the measurement results to the MN.\n\nMeasurements can be configured independently by the MN (for inter-RAT\nmeasurement) and by the SN (intra-RAT measurements on serving and non-\nserving frequencies). The MN indicates the number of frequency layers that\ncan be used in the SN to ensure that UE capabilities are not exceeded. If\nMN and SN both configure measurements on the same carrier frequency then\nthe configurations need to be consistent (if the network wants to ensure\nthese are considered as a single measurement layer). Each node (MN and SN)\ncan configure independently a threshold for the SpCell quality: when the\nPCell quality is above the threshold configured by the MN, the UE is still\nrequired to perform inter-RAT measurements configured by the MN on the SN\nRAT (while it's not required to perform intra-RAT measurements); when the\nPSCell quality is above the threshold configured by the SN, the UE is not\nrequired to perform measurements configured by the SN.\n\n  NOTE:  The SN cannot renegotiate the number of frequency layers allocated\n         by the MN in this version of the protocol.\n\nWhen SRB3 is not configured, reports for measurements configured by the SN\nare sent on SRB1. When SRB3 is configured, reports for measurements\nconfigured by the SN are sent on SRB3.\n\nMeasurement results related to the target SN can be provided by MN to\ntarget SN at MN initiated SN change procedure. Measurement results of\ntarget SN can be forwarded from source SN to target SN via MN at SN\ninitiated SN change procedure. Measurement results related to the target SN\ncan be provided by source MN to target MN at Inter-MN handover with/without\nSN change procedure.\n\nIn EN-DC, measurement results according to measurement configuration from\nthe MN are encoded according to NR RRC when they are provided by MN to SN\nin SgNB Addition Request message. During SN initiated SN change procedure,\nmeasurement results according to measurement configuration from SN are\nencoded according to NR RRC when they are provided by MN to SN in SgNB\nAddition Request message.\n\n\n", "Keywords": "None"}, {"key": "UE capability coordination", "numbering": "7.3", "title_level": 1, "desc": "7.3  UE capability coordination\n\nIn MR-DC, the capabilities of a UE supporting both E-UTRA and NR are\nprovided to both MN and SN. MR-DC band combinations, listing the supported\nE-UTRA and NR band combinations, as well as NR PDCP capabilities (included\nin both E-UTRA Capability and NR capability) are visible to both the MN and\nSN.\n\nOther RAT specific capabilities need not be visible to the node of the\nother RAT. For the UE capabilities requiring coordination between E-UTRA\nand NR (i.e. band combinations, baseband processing capabilities and the\nmaximum power for FR1 the UE can use in SCG), it is up to the MN to decide\non how to resolve the dependency between MN and SN configurations. The MN\nthen provides the resulting UE capabilities usable for SCG configuration to\nthe SN. As part of an SN initiated SN modification, the SN may indicate the\ndesired UE capabilities usable for SCG configuration, and it is up to the\nMN to make the final decision whether to accept or reject the request.\n\n\n", "Keywords": "None"}, {"key": "Handling of combined MN/SN RRC messages", "numbering": "7.4", "title_level": 1, "desc": "7.4  Handling of combined MN/SN RRC messages\n\nWhen both MCG and SCG reconfiguration is required due to the need for\ncoordination with the MN, the SN RRC reconfiguration message is\nencapsulated in an MN RRC message that also carries the corresponding MCG\nreconfiguration that ensures that the combined configuration can be jointly\nprocessed by the UE. If the MN terminates a bearer using NR PDCP, the NR\nPDCP configuration is generated by the MN itself. If the SN terminates the\nbearer, the SN generates the NR PDCP configuration and sends it to the MN\nas a separate container.\n\nThe UE uses a joint success/failure procedure for messages in an\nencapsulating MN RRC message. A failure of the MN RRC messages, including\none encapsulated SN RRC message with or without any MCG reconfiguration\nfields, triggers a re-establishment procedure. Each SN RRC reconfiguration\nmessage should have its own RRC response message even when the SN RRC\nmessage is encapsulated in an MN RRC message. The SN RRC response message\nis forwarded over X2/Xn to the SN. If a SN RRC reconfiguration message is\ncontained in a MN RRC message, the UE sends a MN RRC response message that\nencapsulates the SN RRC response message.\n\n  NOTE:  If the MN RRC message does not encapsulate an SN RRC\n         reconfiguration message (i.e. an SCG configuration) but only\n         information elements generated by the SN (e.g. the PDCP\n         configuration for an SN terminated bearer), the UE will not send an\n         SN RRC response message.\n\n\n", "Keywords": "None"}, {"key": "SRB3", "numbering": "7.5", "title_level": 1, "desc": "7.5  SRB3\n\nThe decision to establish SRB3 is taken by the SN, which provides the SRB3\nconfiguration using an SN RRC message. SRB3 establishment and release can\nbe done at Secondary Node Addition and Secondary Node Change. SRB3\nreconfiguration can be done at Secondary Node Modification procedure.\n\nSRB3 may be used to send SN RRC Reconfiguration, SN RRC Reconfiguration\nComplete and SN Measurement Report messages, only in procedures where the\nMN is not involved. SN RRC Reconfiguration Complete messages are mapped to\nthe same SRB as the message initiating the procedure. SN Measurement Report\nmessages are mapped to SRB3, if configured, regardless of whether the\nconfiguration is received directly from the SN or via the MN. No MN RRC\nmessages are mapped to SRB3.\n\nSRB3 is modelled as one of the SRBs defined in TS 38.331 [4] and uses the\nNR-DCCH logical channel type. RRC PDUs on SRB3 are ciphered and integrity\nprotected using NR PDCP, with security keys derived from S-KgNB. The SN\nselects ciphering and integrity protection algorithms for the SRB3 and\nprovides them to the MN within the SCG Configuration for transmission to\nthe UE.\n\n  NOTE:  A NR SCG RRC message sent via E-UTRA MCG SRB is protected by E-\n         UTRA MCG SRB security (NR security is not used in this case).\n\nSRB3 is of higher scheduling priority than all DRBs. The default scheduling\npriorities of split SRB1 and SRB3 are the same.\n\nThere is no requirement on the UE to perform any reordering of RRC messages\nbetween SRB1 and SRB3.\n\nWhen SCG is released, SRB3 is released.\n\n\n", "Keywords": "None"}, {"key": "Split SRB", "numbering": "7.6", "title_level": 1, "desc": "7.6  Split SRB\n\nSplit SRB is supported for both SRB1 and SRB2 (split SRB is not supported\nfor SRB0 and SRB3). RRC PDUs on split SRB are ciphered and integrity\nprotected using NR PDCP.\n\nSplit SRB can be configured by the MN in Secondary Node Addition and/or\nModification procedure, with SN configuration part provided by the SN. A UE\ncan be configured with both split SRB and SRB3 simultaneously. SRB3 and the\nSCG leg of split SRB can be independently configured.\n\nFor the split SRB, the selection of transmission path in downlink depends\non network implementation. For uplink, the UE is configured via MN RRC\nsignalling whether to use MCG path, SCG path or duplicate the transmission\non both MCG and SCG.\n\n\n", "Keywords": "None"}, {"key": "SCG/MCG failure handling", "numbering": "7.7", "title_level": 1, "desc": "7.7  SCG/MCG failure handling\n\nRLF is declared separately for the MCG and for the SCG.\n\nIf radio link failure is detected for MCG, the UE initiates the RRC\nconnection re-establishment procedure.\n\nIn EN-DC and NGEN-DC, the following SCG failure cases are supported:\n\n  -  SCG RLF;\n\n  -  SN change failure;\n\n  -  SCG configuration failure (only for messages on SRB3);\n\n  -  SCG RRC integrity check failure (on SRB3).\n\nIn EN-DC and NGEN-DC, upon SCG failure the UE suspends SCG transmissions\nfor all radio bearers and reports the SCG Failure Information to the MN,\ninstead of triggering re-establishment.\n\nIn all SCG failure cases, the UE maintains the current measurement\nconfigurations from both the MN and the SN and the UE continues\nmeasurements based on configuration from the MN and the SN if possible. The\nSN measurements configured to be routed via the MN will continue to be\nreported after the SCG failure.\n\n  NOTE:  UE may not continue measurements based on configuration from the\n         SN after SCG failure in certain cases (e.g. UE can not maintain the\n         timing of PSCell).\n\nThe UE includes in the SCG Failure Information message the measurement\nresults available according to current measurement configuration of both\nthe MN and the SN.  The MN handles the SCG Failure Information message and\nmay decide to keep, change, or release the SN/SCG. In all the cases, the\nmeasurement results according to the SN configuration and the SCG failure\ntype may be forwarded to the old SN and/or to the new SN.\n\n\n", "Keywords": "None"}, {"key": "UE identities", "numbering": "7.8", "title_level": 1, "desc": "7.8  UE identities\n\nIn MR-DC, two C-RNTIs are independently allocated to the UE: one for MCG,\nand one for SCG.\n\n\n", "Keywords": "None"}, {"key": "Inter-node Resource Coordination", "numbering": "7.9", "title_level": 1, "desc": "7.9  Inter-node Resource Coordination\n\nFor EN-DC operation, MN and SN may coordinate their UL and DL radio\nresources in semi-static manner via UE associated signalling.\n\n\n", "Keywords": "None"}, {"key": "Bearer handling aspects", "numbering": "8", "title_level": 0, "desc": "8  Bearer handling aspects\n\n\n", "Keywords": "None"}, {"key": "QoS aspects", "numbering": "8.1", "title_level": 1, "desc": "8.1  QoS aspects\n\nIn EN-DC, the E-UTRAN QoS framework defined in TS 36.300 [2] applies:\n\n  -  An S1-U bearer is established between the EPC and the SN for SN\n    terminated bearers;\n\n  -  An X2-U bearer is established between the MN and the SN for split\n    bearers, MN terminated SCG bearers and SN terminated MCG bearers;\n\n  -  MN terminated and SN terminated bearers may have either MCG or SCG\n    radio resources or both, MCG and SCG radio resources, established;\n\n  -  The MN decides the split of DL UE AMBR limits and UL UE AMBR limits\n    among the MN and the SN respectively, and indicates DL UE AMBR limits\n    and UL UE AMBR limits to be respected by the SN;\n\n  -  The node that hosts the PDCP entity enforces the respective DL UE AMBR\n    limits;\n\n  -  Each node enforces the respective UL UE AMBR limits. For SN terminated\n    bearers, if the node is not configured to serve the uplink, it ignores\n    the indicated UL UE-AMBR.\n\nIn MR-DC with 5GC:\n\n  -  The NG-RAN QoS framework defined in TS 38.300 [3] applies;\n\n  -  QoS flows belonging to the same PDU session may be mapped to different\n    bearer types (see subclause 4.2.2) and as a result there may be two\n    different SDAP entities configured for the same PDU session: one at the\n    MN and another one at the SN, in which case the MN decides which QoS\n    flows are assigned to the SDAP entity in the SN;\n\n  -  The MN or SN node that hosts the SDAP entity for a given QoS flow\n    decides how to map the QoS flow to DRBs;\n\n  -  If the SDAP entity for a given QoS flow is hosted by the MN and the MN\n    decides that SCG resources are to be configured it provides QoS flow to\n    DRB mapping information and the respective per QoS flow information to\n    the SN;\n\n  -  If the SDAP entity for a given QoS flow is hosted by the SN, the MN\n    provides sufficient QoS related information to enable the SN to\n    configure appropriate SCG resources and to request the configuration of\n    appropriate MCG resources. The MN may offer MCG resources to the SN and\n    may indicate for GBR QoS flows the amount offered to the SN on a per\n    QoS flow level.\n\nTo support PDU sessions mapped to different bearer types, MR-DC with 5GC\nprovides the possibility for the MN to request the 5GC:\n\n  -  For some PDU sessions of a UE: Direct the User Plane traffic of the\n    whole PDU session either to the MN or to the SN. In that case, there is\n    a single NG-U tunnel termination at the NG-RAN for such PDU session.\n\n    -  The MN may request to change this assignment during the life time of\n       the PDU session.\n\n  -  For some other PDU sessions of a UE: Direct the User Plane traffic of\n    a subset of the QoS flows of the PDU session to the SN (respectively\n    MN) while the rest of the QoS flows of the PDU session is directed to\n    the MN (respectively SN). In that case, there are two NG-U tunnel\n    terminations at the NG-RAN for such PDU session.\n\n    -  The MN may request to change this assignment during the life time of\n       the PDU session.\n\n\n", "Keywords": "None"}, {"key": "Bearer type selection", "numbering": "8.2", "title_level": 1, "desc": "8.2  Bearer type selection\n\nIn EN-DC, for each radio bearer the MN decides the location of the PDCP\nentity and in which cell group(s) radio resources are to be configured.\nOnce an SN terminated split bearer is established, e.g. by means of the\nSecondary Node Addition procedure or MN initiated Secondary Node\nModification procedure, the SN may remove and later on add SCG resources\nfor the respective E-RAB, as long as the QoS for the respective E-RAB is\nguaranteed.\n\nIn MR-DC with 5GC, the following principles apply:\n\n  -  The MN decides per PDU session the location of the SDAP entity, i.e.\n    whether it shall be hosted by the MN or the SN or by both;\n\n  -  If the MN decides to host an SDAP entity it may decide some of the\n    related QoS flows to be realized as MCG bearer, some as SCG bearer, and\n    others to be realized as split bearer;\n\n  -  If the MN decides that an SDAP entity shall be hosted in the SN, some\n    of the related QoS flows may be realized as SCG bearer, some as MCG\n    bearer, while others may be realized as split bearer. The SN may remove\n    or add SCG resources for the respective QoS flows, as long as the QoS\n    for the respective QoS flow is guaranteed.\n\n\n", "Keywords": "None"}, {"key": "Bearer type change", "numbering": "8.3", "title_level": 1, "desc": "8.3  Bearer type change\n\nIn MR-DC, all the possible bearer type change options are supported:\n\n  -  MCG bearer to/from split bearer;\n\n  -  MCG bearer to/from SCG bearer;\n\n  -  SCG bearer to/from split bearer.\n\nBearer termination point change is supported for all bearer types, and can\nbe performed with or without bearer type change:\n\n  -  MN terminated bearer to/from SN terminated bearer.\n\nFor EN-DC:\n\n  -  when the security key is changed for a bearer, the associated PDCP and\n    RLC entities are re-established, while MAC behavior might depend on the\n    solution selected by the network, e.g. MAC reset, change of LCID, etc.\n    (see Annex A);\n\n  -  for MCG bearer, split bearer and SCG bearer, during handover MCG/SCG\n    PDCP and RLC are re-established and MCG/SCG MAC is reset;\n\n  -  if a bearer type change happens through handover procedure then for\n    MCG bearer, split bearer and SCG bearer, MCG/SCG PDCP/RLC are re-\n    established and MCG/SCG MAC is reset;\n\n  -  if a bearer type change happens through SN change procedure, then SN\n    terminated PDCP /RLC are re-established and SCG MAC is reset;\n\n  -  one step (direct) bearer type change between MN terminated bearer\n    types without using the handover procedure is supported;\n\n  -  one step (direct) bearer type change between SN terminated bearer\n    types without using the handover or SN change procedure is supported;\n\n  -  for bearer type change between MCG bearer and SCG bearer MAC is not\n    reset; the original RLC entity is released and new RLC entity is\n    established;\n\n  -  PDCP version change for DRB or PDCP SN length change for an AM DRB is\n    performed using a release and add of the DRBs (in a single message) or\n    full configuration;\n\n  -  One step (direct) bearer type change with PDCP version change is\n    supported;\n\n  -  Upon bearer type change from MCG bearer to SCG bearer or from split\n    bearer to SCG bearer, the associated LTE RLC entity is first re-\n    established and then released:\n\n  NOTE:  L2 handling for bearer type change in EN-DC is also summarized in\n         Annex A (the table does not consider the case that PDCP SN length\n         is changed).\n\n\n", "Keywords": "None"}, {"key": "User data forwarding", "numbering": "8.4", "title_level": 1, "desc": "8.4  User data forwarding\n\nUpon EN-DC specific activities, user data forwarding may be performed for E-\nRABs for which the bearer type change from/to MN terminated bearer to/from\nSN terminated bearer is performed. The behaviour of the node from which\ndata is forwarded is the same as specified for the \"source eNB\" for\nhandover, the behaviour of the node to which data is forwarded is the same\nas specified for the \"target eNB\" for handover.\n\nFor MR-DC with 5GC, user data forwarding may be performed between NG-RAN\nnodes whenever the logical node hosting the PDCP entity changes. The\nbehaviour of the node from which data is forwarded is the same as specified\nfor the \"source NG-RAN node\" for handover, the behaviour of the node to\nwhich data is forwarded is the same as specified for the \"target NG-RAN\nnode\" for handover.\n\n\n", "Keywords": "None"}, {"key": "Security related aspects", "numbering": "9", "title_level": 0, "desc": "9  Security related aspects\n\nEN-DC can only be configured after security activation in the MN.\n\nIn EN-DC, for bearers terminated in the MN the network configures the UE\nwith KeNB; for bearers terminated in the SN the network configures the UE\nwith S-KgNB.\n\nFor mobility scenarios that involve only a change of the SCG (i.e. no Pcell\nhandover and hence no KeNB change), S-KgNB key refresh is not required if\nthe PDCP termination point of the SN is not changed.\n\nIn EN-DC, the UE supports the NR security algorithms corresponding to the E-\nUTRA security algorithms signalled at NAS level and the UE NR AS Security\ncapability is not signalled to the MN over RRC. Mapping from E-UTRA\nsecurity algorithms to the corresponding NR security algorithms, where\nnecessary, is performed at the MN.\n\nFor MR-DC with 5GC, UP integrity protection can be configured on a per\nradio bearer basis.\n\n\n", "Keywords": "None"}, {"key": "Multi-Connectivity operation related aspects", "numbering": "10", "title_level": 0, "desc": "10 Multi-Connectivity operation related aspects\n\n\n", "Keywords": "None"}, {"key": "General", "numbering": "10.1", "title_level": 1, "desc": "10.1 General\n\nSimilar procedures as defined under section 10.1.2.8 (Dual Connectivity\noperation) in TS 36.300 [2] apply for MR-DC.\n\n\n", "Keywords": "None"}, {"key": "Secondary Node Addition", "numbering": "10.2", "title_level": 1, "desc": "10.2 Secondary Node Addition\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.2.1", "title_level": 2, "desc": "10.2.1 EN-DC\n\nThe Secondary Node Addition procedure is initiated by the MN and is used to\nestablish a UE context at the SN to provide radio resources from the SN to\nthe UE. For bearers requiring SCG radio resources, this procedure is used\nto add at least the first cell of the SCG. This procedure can also be used\nto configure an SN terminated MCG bearer (where no SCG configuration is\nneeded). Figure 10.2.1-1 shows the Secondary Node Addition procedure.\n\n                                    [pic]\n\n             Figure 10.2.1-1: Secondary Node Addition procedure\n\n  1. The MN decides to request the SN to allocate radio resources for a\n    specific E-RAB, indicating E-RAB characteristics (E-RAB parameters, TNL\n    address information corresponding to bearer type). In addition, for\n    bearers requiring SCG radio resources, MN indicates the requested SCG\n    configuration information, including the entire UE capabilities and the\n    UE capability coordination result. In this case, the MN also provides\n    the latest measurement results for SN to choose and configure the SCG\n    cell(s). The MN may request the SN to allocate radio resources for\n    split SRB operation. The MN always provides all the needed security\n    information to the SN (even if no SN terminated bearers are setup) to\n    enable SRB3 to be setup based on SN decision. In case of bearer options\n    that require X2-U resources between the MN and the SN, the MN provides\n    X2-U TNL address information for the respective E-RAB, X2-U DL TNL\n    address information for SN terminated bearers, X2-U UL TNL address\n    information for MN terminated bearers. In case of SN terminated split\n    bearers the MN provides the maximum QoS level that it can support. The\n    SN may reject the request.\n\n  NOTE 1:  For split bearers, MCG and SCG resources may be requested of\n         such an amount, that the QoS for the respective E-RAB is guaranteed\n         by the exact sum of resources provided by the MCG and the SCG\n         together, or even more. For MN terminated split bearers, the MNs\n         decision is reflected in step 1 by the E-RAB parameters signalled\n         to the SN, which may differ from E-RAB parameters received over S1.\n\n  NOTE 2:  For a specific E-RAB, the MN may request the direct\n         establishment of an SCG or a split bearer, i.e., without first\n         having to establish an MCG bearer. It is also allowed that all E-\n         RABs can be configured as SN terminated bearers, i.e. there is no E-\n         RAB established as an MN terminated bearer.\n\n  2. If the RRM entity in the SN is able to admit the resource request, it\n    allocates respective radio resources and, dependent on the bearer\n    option, respective transport network resources. For bearers requiring\n    SCG radio resources, the SN triggers Random Access so that\n    synchronisation of the SN radio resource configuration can be\n    performed. The SN decides the Pscell and other SCG Scells and provides\n    the new SCG radio resource configuration to the MN in a NR RRC\n    configuration message contained in the SgNB Addition Request\n    Acknowledge message. In case of bearer options that require X2-U\n    resources between the MN and the SN, the SN provides X2-U TNL address\n    information for the respective E-RAB, X2-U UL TNL address information\n    for SN terminated bearers, X2-U DL TNL address information for MN\n    terminated bearers. For SN terminated bearers, the SN provides the S1-U\n    DL TNL address information for the respective E-RAB and security\n    algorithm. If SCG radio resources have been requested, the SCG radio\n    resource configuration is provided.\n\n  NOTE 3:  For the SN terminated split bearer option, the SN may either\n         decide to request resources from the MN of such an amount, that the\n         QoS for the respective E-RAB is guaranteed by the exact sum of\n         resources provided by the MN and the SN together, or even more. The\n         SNs decision is reflected in step 2 by the E-RAB parameters\n         signalled to the MN, which may differ from E-RAB parameters\n         received in step 1. The QoS level requested from the MN shall not\n         exceed the level that the MN offered when setting up the split\n         bearer in step 1.\n\n  NOTE 4:  In case of MN terminated bearers, transmission of user plane\n         data may take place after step 2.\n\n  NOTE 5:  In case of SN terminated bearers , data forwarding and the SN\n         Status Transfer may take place after step 2.\n\n  3. The MN sends to the UE the RRCConnectionReconfiguration message\n    including the NR RRC configuration message, without modifying it.\n\n  4. The UE applies the new configuration and replies to MN with\n    RRCConnectionReconfigurationComplete message, including a NR RRC\n    response message, if needed. In case the UE is unable to comply with\n    (part of) the configuration included in the\n    RRCConnectionReconfiguration message, it performs the reconfiguration\n    failure procedure.\n\n  5. The MN informs the SN that the UE has completed the reconfiguration\n    procedure successfully via SgNB ReconfigurationComplete message,\n    including the encoded NR RRC response message, if received from the UE.\n\n  6. If configured with bearers requiring SCG radio resources, the UE\n    performs synchronisation towards the PSCell of the SN. The order the UE\n    sends the RRCConnectionReconfigurationComplete message and performs the\n    Random Access procedure towards the SCG is not defined. The successful\n    RA procedure towards the SCG is not required for a successful\n    completion of the RRC Connection Reconfiguration procedure.\n\n  7. In case of SN terminated bearers using RLC AM, the MN sends SN Status\n    Transfer.\n\n  8. In case of SN terminated bearers using RLC AM, and dependent on the\n    bearer characteristics of the respective E-RAB, the MN may take actions\n    to minimise service interruption due to activation of EN-DC (Data\n    forwarding).\n\n  9-12.  For SN terminated bearers, the update of the UP path towards the\n    EPC is performed.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.2.2", "title_level": 2, "desc": "10.2.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nThe Secondary Node (SN) Addition procedure is initiated by the MN and is\nused to establish a UE context at the SN in order to provide radio\nresources from the SN to the UE. For bearers requiring SCG radio resources,\nthis procedure is used to add at least the initial SCG serving cell of the\nSCG. This procedure can also be used to configure an SN terminated MCG\nbearer (where no SCG configuration is needed). Figure 10.2.2-1 shows the SN\nAddition procedure.\n\n                                    [pic]\n\n                   Figure 10.2.2-1: SN Addition procedure\n\n  1. The MN decides to request the target SN to allocate radio resources\n    for one or more specific PDU Sessions/QoS Flows, indicating QoS Flows\n    characteristics (QoS Flow Level QoS parameters, PDU session level TNL\n    address information, and PDU session level Network Slice info). In\n    addition, for bearers requiring SCG radio resources, MN indicates the\n    requested SCG configuration information, including the entire UE\n    capabilities and the UE capability coordination result. In this case,\n    the MN also provides the latest measurement results for SN to choose\n    and configure the SCG cell(s). The MN may request the SN to allocate\n    radio resources for split SRB operation. The MN always provides all the\n    needed security information to the SN (even if no SN terminated bearers\n    are setup) to enable SRB3 to be setup based on SN decision. For bearer\n    options that require Xn-U resources between the MN and the SN, MN needs\n    to provide Xn-U TNL address information, Xn-U DL TNL address\n    information for SN terminated bearers and Xn-U UL TNL address\n    information for MN terminated bearers. The SN may reject the request.\n\n  NOTE 1:  For split bearers, MCG and SCG resources may be requested of\n         such an amount, that the QoS for the respective QoS Flow is\n         guaranteed by the exact sum of resources provided by the MCG and\n         the SCG together, or even more. For MN terminated split bearers,\n         the MN decision is reflected in step 1 by the QoS Flow parameters\n         signalled to the SN, which may differ from QoS Flow parameters\n         received over NG.\n\n  NOTE 2:  For a specific QoS flow, the MN may request the direct\n         establishment of SCG and/or split bearers, i.e. without first\n         having to establish MCG bearers. It is also allowed that all QoS\n         flows can be mapped to SN terminated bearers, i.e. there is no QoS\n         flow mapped to an MN terminated bearer.\n\n  2. If the RRM entity in the SN is able to admit the resource request, it\n    allocates respective radio resources and, dependent on the bearer type\n    options, respective transport network resources. For bearers requiring\n    SCG radio resources the SN triggers UE Random Access so that\n    synchronisation of the SN radio resource configuration can be\n    performed. The SN decides for the PScell and other SCG Scells and\n    provides the new SCG radio resource configuration to the MN in a SN RRC\n    configuration message contained in the SN Addition Request Acknowledge\n    message. In case of bearer options that require Xn-U resources between\n    the MN and the SN, the SN provides Xn-U TNL address information for the\n    respective E-RAB, Xn-U UL TNL address information for SN terminated\n    bearers, Xn-U DL TNL address information for MN terminated bearers.\n    For SN terminated bearers, the SN provides the NG-U DL TNL address\n    information for the respective PDU Session and security algorithm. If\n    SCG radio resources have been requested, the SCG radio resource\n    configuration is provided.\n\n  NOTE 3:  In case of MN terminated bearers, transmission of user plane\n         data may take place after step 2.\n\n  NOTE 4:  In case of SN terminated bearers, data forwarding and the SN\n         Status Transfer may take place after step 2.\n\n  3. The MN sends the MN RRC reconfiguration message to the UE including\n    the SN RRC configuration message, without modifying it.\n\n  4. The UE applies the new configuration and replies to MN with MN RRC\n    reconfiguration complete message, including a SN RRC response message\n    for SN, if needed. In case the UE is unable to comply with (part of)\n    the configuration included in the MN RRC reconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  5. The MN informs the SN that the UE has completed the reconfiguration\n    procedure successfully via SN Reconfiguration Complete message,\n    including the encoded SN RRC response message, if received from the UE.\n\n  6. If configured with bearers requiring SCG radio resources, the UE\n    performs synchronisation towards the PSCell configured by the SN. The\n    order the UE sends the MN RRC reconfiguration complete message and\n    performs the Random Access procedure towards the SCG is not defined.\n    The successful RA procedure towards the SCG is not required for a\n    successful completion of the RRC Connection Reconfiguration procedure.\n\n  7. In case of SN terminated bearers using RLC AM, the MN sends SN Status\n    Transfer.\n\n  8. In case of SN terminated bearers using RLC AM, and dependent on the\n    bearer characteristics of the respective QoS Flows, the MN may take\n    actions to minimise service interruption due to activation of MR-DC\n    (Data forwarding).\n\n  9-12.  For SN terminated bearers, the update of the UP path towards the\n    5GC is performed via PDU Session Path Update procedure.\n\n\n", "Keywords": "None"}, {"key": "Secondary Node Modification (MN/SN initiated)", "numbering": "10.3", "title_level": 1, "desc": "10.3 Secondary Node Modification (MN/SN initiated)\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.3.1", "title_level": 2, "desc": "10.3.1 EN-DC\n\nThe Secondary Node Modification procedure may be initiated either by the MN\nor by the SN and be used to modify, establish or release bearer contexts,\nto transfer bearer contexts to and from the SN or to modify other\nproperties of the UE context within the same SN. It may also be used to\ntransfer an NR RRC message from the SN to the UE via the MN and the\nresponse from the UE via MN to the SN (e.g. when SRB3 is not used).\n\nThe Secondary Node modification procedure does not necessarily need to\ninvolve signalling towards the UE.\n\nMN initiated SN Modification\n\n                                    [pic]\n\n          Figure 10.3.1-1: SN Modification procedure - MN initiated\n\nThe MN uses the procedure to initiate configuration changes of the SCG\nwithin the same SN, e.g. the addition, modification or release of SCG\nbearer(s) and the SCG RLC bearer of split bearer(s), as well as\nconfiguration changes for SN terminated MCG bearers. Bearer type change may\nresult in adding the new bearer configuration and releasing the old bearer\nconfiguration within a single MN initiated SN Modification procedure for\nthe respective E-RAB. The MN uses this procedure to perform handover within\nthe same MN while keeping the SN. The MN also uses the procedure to query\nthe current SCG configuration, e.g. when delta configuration is applied in\na MN initiated SN change. MN may not use the procedure to initiate the\naddition, modification or release of SCG Scells. The SN may reject the\nrequest, except if it concerns the release of SN terminated bearer(s) or\nthe SCG RLC bearer of MN terminated bearer(s), or if it is used to perform\nhandover within the same MN while keeping the SN. Figure 10.3.1-1 shows an\nexample signalling flow for a MN initiated SN Modification procedure.\n\n  1. The MN sends the SgNB Modification Request message, which may contain\n    bearer context related or other UE context related information, data\n    forwarding address information (if applicable) and the requested SCG\n    configuration information, including the UE capability coordination\n    result to be used as basis for the reconfiguration by the SN. In case a\n    security key update in the SN is required, a new SgNB Security Key is\n    included. In case of SCG RLC re-establishment for E-RABs configured\n    with an MN terminated bearer with an SCG RLC bearer for which no bearer\n    type change is performed, the MN provides a new UL GTP TEID to the SN.\n    The SN shall continue sending UL PDCP PDUs to the MN with the previous\n    UL GTP TEID until it re-establishes the RLC and use the new UL GTP TEID\n    after re-establishment. In case of PDCP re-establishment for E-RABs\n    configured with an SN terminated bearer with an MCG RLC bearer for\n    which no bearer type change is performed, the MN provides a new DL GTP\n    TEID to the SN. The SN shall continue sending DL PDCP PDUs to the MN\n    with the previous DL GTP TEID until it performs PDCP re-establishment\n    and use the new DL GTP TEID starting with the PDCP re-establishment.\n\n  2. The SN responds with the SgNB Modification Request Acknowledge\n    message, which may contain SCG radio resource configuration information\n    within a NR RRC configuration message and data forwarding address\n    information (if applicable).  In case of a PSCell change with security\n    key update, for E-RABs configured with the MN terminated bearer option\n    that require X2-U resources between the MN and the SN, for which no\n    bearer type change is performed, the SN provides a new DL GTP TEID to\n    the MN. The MN shall continue sending DL PDCP PDUs to the SN with the\n    previous DL GTP TEID until it performs PDCP re-establishment or PDCP\n    data recovery, and use the new DL GTP TEID starting with the PDCP re-\n    establishment or data recovery. In case of a PSCell change with\n    security key update, for E-RABs configured with the SN terminated\n    bearer option that require X2-U resources between the MN and the SN,\n    for which no bearer type change is performed, the SN provides a new UL\n    GTP TEID to the MN. The MN shall continue sending UL PDCP PDUs to the\n    SN with the previous UL GTP TEID until it re-establishes the RLC and\n    use the new UL GTP TEID after re-establishment.\n\n  3-5. The MN initiates the RRC connection reconfiguration procedure,\n    including the NR RRC configuration message. The UE applies the new\n    configuration, synchronizes to the MN (if instructed, in case of intra-\n    MN handover) and replies with RRCConnectionReconfigurationComplete,\n    including a NR RRC response message, if needed. In case the UE is\n    unable to comply with (part of) the configuration included in the\n    RRCConnectionReconfiguration message, it performs the reconfiguration\n    failure procedure.\n\n  6. Upon successful completion of the reconfiguration, the success of the\n    procedure is indicated in the SgNB Reconfiguration Complete message.\n\n  7. If instructed, the UE performs synchronisation towards the PSCell of\n    the SN as described in SgNB addition procedure. Otherwise, the UE may\n    perform UL transmission after having applied the new configuration.\n\n  8. If PDCP termination point is changed for bearers using RLC AM, and\n    when RRC full configuration is not used, the MN sends the SN Status\n    transfer.\n\n  9. If applicable, data forwarding between MN and the SN takes place\n    (Figure 10.3.1-1 depicts the case where a bearer context is transferred\n    from the MN to the SN).\n\n  10.  The SN sends the Secondary RAT Data Volume Report message to the MN\n    and includes the data volumes delivered to the UE over the NR radio for\n    the E-RABs to be released.\n\n  NOTE 1:  The order the SN sends the Secondary RAT Data Volume Report\n         message and performs data forwarding with MN is not defined. The SN\n         may send the report when the transmission of the related bearer is\n         stopped.\n\n  11.  If applicable, a path update is performed.\n\nSN initiated SN Modification with MN involvement\n\n                                    [pic]\n\n      Figure 10.3.1-2: SN Modification procedure - SN initiated with MN\n                                 involvement\n\nThe SN uses the procedure to perform configuration changes of the SCG\nwithin the same SN, e.g. to trigger the release of SCG bearer(s) and the\nSCG RLC bearer of split bearer(s) (upon which the MN may release the bearer\nor maintain current bearer type or reconfigure it to an MCG bearer, either\nMN terminated or SN terminated), and to trigger PSCell change (e.g. when a\nnew security key is required or when the MN needs to perform PDCP data\nrecovery). The MN cannot reject the release request of SCG bearer and the\nSCG RLC bearer of a split bearer. Figure 10.3.1.-2 shows an example\nsignalling flow for an SN initiated SgNB Modification procedure, with MN\ninvolvement.\n\n  1. The SN sends the SgNB Modification Required message including a NR RRC\n    configuration message, which may contain bearer context related, other\n    UE context related information and the new SCG radio resource\n    configuration. For bearer release or modification, a corresponding E-\n    RAB list is included in the SgNB Modification Required message. In case\n    of change of security key, the PDCP Change Indication indicates that a\n    S-KgNB update is required. In case the MN needs to perform PDCP data\n    recovery, the PDCP Change Indication indicates that PDCP data recovery\n    is required.\n\n    The SN can decide whether the change of security key is required.\n\n  2/3. If data forwarding and/or SN security key change needs to be\n    applied, the MN triggers the preparation of the MN initiated SN\n    Modification procedure and provides forwarding address and/or a new SN\n    security key information within the SgNB Modification Request message,\n    respectively.\n\n  NOTE 2:  If only SN security key is provided in step 2, the MN does not\n         need to wait for the reception of step 3 to initiate the RRC\n         connection reconfiguration procedure.\n\n  4. The MN sends the RRCConnectionReconfiguration message including a NR\n    RRC configuration message to the UE including the new SCG radio\n    resource configuration.\n\n  5. The UE applies the new configuration and sends the\n    RRCConnectionReconfigurationComplete message, including an encoded NR\n    RRC response message, if needed. In case the UE is unable to comply\n    with (part of) the configuration included in the\n    RRCConnectionReconfiguration message, it performs the reconfiguration\n    failure procedure.\n\n  6. Upon successful completion of the reconfiguration, the success of the\n    procedure is indicated in the SgNB Modification Confirm message\n    containing the encoded NR RRC response message, if received from the\n    UE.\n\n  7. If instructed, the UE performs synchronisation towards the PSCell of\n    the SN as described in SN addition procedure. Otherwise, the UE may\n    perform UL transmission after having applied the new configuration.\n\n  8. If PDCP termination point is changed for bearers using RLC AM, and\n    when RRC full configuration is not used, the SN sends the MN Status\n    transfer.\n\n  9. If applicable, data forwarding between MN and the SN takes place\n    (Figure 10.3.1-2 depicts the case where a bearer context is transferred\n    from the SN to the MN).\n\n  10.  The SN sends the Secondary RAT Data Volume Report message to the MN\n    and includes the data volumes delivered to the UE over the NR radio for\n    the E-RABs to be released.\n\n  NOTE 3:  The order the SN sends the Secondary RAT Data Volume Report\n         message and performs data forwarding with MN is not defined. The SN\n         may send the report when the transmission of the related bearer is\n         stopped.\n\n  11.  If applicable, a path update is performed.\n\nSN initiated SN Modification without MN involvement\n\n                                    [pic]\n\n   Figure 10.3.1-3: SN modification - SN initiated without MN involvement\n\nThe SN initiated modification without  MN  involved  procedure  is  used  to\nmodify the configuration within SN  in  case  no  coordination  with  MN  is\nrequired, including  the  addition/modification/release  of  SCG  Scell  and\nPSCell change (e.g. when the security key does not need to  be  changed  and\nthe MN does not need to be  involved  in  PDCP  recovery).  Figure  10.3.1-3\nshows  an  example  signalling  flow  for  SN  initiated   SN   modification\nprocedure, without MN involvement. The SN  can  decide  whether  the  Random\nAccess procedure is required.\n\n  1. The SN sends the RRCConnectionReconfiguration message to the UE\n    through SRB3. The UE applies the new configuration. In case the UE is\n    unable to comply with (part of) the configuration included in the\n    RRCConnectionReconfiguration message, it performs the reconfiguration\n    failure procedure.\n\n  2. If instructed, the UE performs synchronisation towards the PSCell of\n    the SN.\n\n  3. The UE replies with the RRCConnectionReconfigurationComplete message.\n\nTransfer of an NR RRC message to/from the UE (when SRB3 is not used)\n\n                                    [pic]\n\n        Figure 10.3.1-4: Transfer of an NR RRC message to/from the UE\n\nThe SN initiates the procedure when it needs to transfer an NR  RRC  message\nto the UE and SRB3 is not used.\n\n  1. The SN initiates the procedure by sending the SgNB Modification\n    Required to the MN.\n\n  2. The MN forwards the NR RRC message to the UE in the\n    RRCConnectionReconfiguration message.\n\n  3. The UE applies the new configuration and replies with the\n    RRCConnectionReconfigurationComplete message.\n\n  4. The MN forwards the NR RRC response message, if received from the UE,\n    to the SN in the SgNB Modification Confirm message.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.3.2", "title_level": 2, "desc": "10.3.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nThe SN Modification procedure may be initiated either by the MN or by the\nSN and be used to modify, establish or release PDU session/QoS Flow\ncontexts, to transfer PDU session/QoS Flow contexts to and from the SN or\nto modify other properties of the UE context within the same SN. It may\nalso be used to transfer an NR RRC message from the SN to the UE via the MN\nand the response from the UE via MN to the SN (e.g. when SRB3 is not used).\n\nThe SN modification procedure does not necessarily need to involve\nsignalling towards the UE.\n\nMN initiated SN Modification\n\n                                    [pic]\n\n          Figure 10.3.2-1: SN Modification procedure - MN initiated\n\nThe MN uses the procedure to initiate configuration changes of the SCG\nwithin the same SN, including addition, modification or release PDU\nsession/QoS Flows mapped onto SN terminated bearer(s) and MN terminated\nbearers with an SCG RLC bearer. The MN uses the procedure to query the\ncurrent SCG configuration, e.g. when delta configuration is applied in a MN\ninitiated SN change. MN may not use the procedure to initiate the addition,\nmodification or release of SCG Scells. The SN may reject the request,\nexcept if it concerns the release of PDU session/QoS flow. Figure 10.3.2-1\nshows an example signalling flow for a MN initiated SN Modification\nprocedure.\n\n  1. The MN sends the SN Modification Request message, which may contain\n    PDU session/QoS Flow context related or other UE context related\n    information, data forwarding address information (if applicable), PDU\n    session level Network Slice info and the requested SCG configuration\n    information, including the UE capabilities coordination result to be\n    used as basis for the reconfiguration by the SN.\n\n  2. The SN responds with the SN Modification Request Acknowledge message,\n    which may contain new SCG radio configuration information within a SN\n    RRC configuration message, and data forwarding address information (if\n    applicable).\n\n  3/4. The MN initiates the RRC connection reconfiguration procedure,\n    including SN RRC configuration message. The UE applies the new\n    configuration and replies with MN RRC reconfiguration complete message,\n    including a SN RRC response message, if needed. In case the UE is\n    unable to comply with (part of) the configuration included in the MN\n    RRC reconfiguration message, it performs the reconfiguration failure\n    procedure.\n\n  5. Upon successful completion of the reconfiguration, the success of the\n    procedure is indicated in the SN Reconfiguration Complete message.\n\n  6. If instructed, the UE performs synchronisation towards the PSCell of\n    the SN as described in SN addition procedure. Otherwise, the UE may\n    perform UL transmission after having applied the new configuration.\n\n  7. If PDCP termination point is changed for bearers using RLC AM, and\n    when RRC full configuration is not used, the MN sends the SN Status\n    transfer.\n\n  8. If applicable, data forwarding between MN and the SN takes place\n    (Figure 10.3.2-1 depicts the case where a PDU session/QoS Flow context\n    is transferred from the MN to the SN).\n\n  9. If applicable, a PDU Session path update procedure is performed.\n\nSN initiated SN Modification with MN involvement\n\n                                    [pic]\n\n      Figure 10.3.2-2: SN Modification procedure - SN initiated with MN\n                                 involvement\n\nThe SN uses the procedure to perform configuration changes of the SCG\nwithin the same SN, e.g. to trigger the modification/release of PDU\nsession/QoS flows and to trigger PSCell changes (when MN involvement is\nneeded for this). The MN cannot reject the release request of PDU\nsession/QoS flows. Figure 10.3.2-2 shows an example signalling flow for SN\ninitiated SN Modification procedure.\n\n  1. The SN sends the SN Modification Required message including a SN RRC\n    configuration message, which may contain PDU session/QoS Flow context\n    related, other UE context related information and the new radio\n    resource configuration of SCG. For the release or modification of PDU\n    session/QoS flow, a corresponding PDU session/QoS Flows list is\n    included in the SN Modification Required message.\n\n     The SN can decide whether the change of security key is required.\n\n  2/3. The MN initiated SN Modification procedure may be triggered by SN\n    Modification Required message.\n\n  4. The MN sends the MN RRC reconfiguration message to the UE including\n    the SN RRC configuration message the new SCG radio resource\n    configuration.\n\n  5. The UE applies the new configuration and sends the MN RRC\n    reconfiguration complete message, including an encoded SN RRC response\n    message, if needed. In case the UE is unable to comply with (part of)\n    the configuration included in the MN RRC reconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  6. Upon successful completion of the reconfiguration, the success of the\n    procedure is indicated in the SN Modification Confirm message\n    containing the encoded SN RRC response message, if received from the\n    UE.\n\n  7. If instructed, the UE performs synchronisation towards the PSCell\n    configured by the SN as described in SN Addition procedure. Otherwise,\n    the UE may perform UL transmission directly after having applied the\n    new configuration.\n\n  8. If PDCP termination point is changed for bearers using RLC AM, and\n    when RRC full configuration is not used, the SN sends the MN Status\n    transfer.\n\n  9. If applicable, data forwarding between MN and the SN takes place\n    (Figure 10.3.2-2 depicts the case where a PDU session/QoS Flow context\n    is transferred from the SN to the MN).\n\n  10.  If applicable, a PDU Session path update procedure is performed.\n\nSN initiated SN Modification without MN involvement\n\nThis procedure is not supported for NE-DC.\n\n                                    [pic]\n\n   Figure 10.3.2-3: SN Modification – SN initiated without MN involvement\n\nThe SN initiated SN modification procedure without MN involvement is used\nto modify the configuration within SN in case no coordination with MN is\nrequired, including the addition/modification/release of SCG Scell and\nPSCell change (when MN involvement is not needed for this). Figure 10.3.2-3\nshows an example signalling flow for SN initiated SN modification procedure\nwithout MN involvement. The SN can decide whether the Random Access\nprocedure is required.\n\n  1. The SN sends the SN RRC reconfiguration message to the UE through\n    SRB3.\n\n  2. The UE applies the new configuration and replies with the SN RRC\n    reconfiguration complete message. In case the UE is unable to comply\n    with (part of) the configuration included in the SN RRC reconfiguration\n    message, it performs the reconfiguration failure procedure.\n\n  3. If instructed, the UE performs synchronisation towards the PSCell of\n    the SN as described in SN Addition procedure. Otherwise the UE may\n    perform UL transmission after having applied the new configuration.\n\nTransfer of an NR RRC message to/from the UE (when SRB3 is not used)\n\n                                    [pic]\n\n        Figure 10.3.2-4: Transfer of an NR RRC message to/from the UE\n\nThe SN initiates the procedure when it needs to transfer an NR  RRC  message\nto the UE and SRB3 is not used.\n\n  1. The SN initiates the procedure by sending the SN Modification Required\n    to the MN.\n\n  2. The MN forwards the NR RRC message to the UE in the RRC\n    reconfiguration message.\n\n  3. The UE applies the new configuration and replies with the RRC\n    reconfiguration complete message.\n\n  4. The MN forwards the NR RRC response message, if received from the UE,\n    to the SN in the SN Modification Confirm message.\n\n\n", "Keywords": "None"}, {"key": "Secondary Node Release (MN/SN initiated)", "numbering": "10.4", "title_level": 1, "desc": "10.4 Secondary Node Release (MN/SN initiated)\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.4.1", "title_level": 2, "desc": "10.4.1 EN-DC\n\nThe Secondary Node Release procedure may be initiated either by the MN or\nby the SN and is used to initiate the release of the UE context at the SN.\nThe recipient node of this request can reject it, e.g., if a SN change\nprocedure is triggered by the SN.\n\nIt does not necessarily need to involve signalling towards the UE, e.g., in\ncase of the RRC connection re-establishment due to Radio Link Failure in\nMN.\n\nMN initiated SN Release\n\n                                    [pic]\n\n            Figure 10.4.1-1: SN Release procedure – MN initiated\n\nFigure 10.4.1-1 shows an example signalling flow for the MN initiated\nSecondary Node Release procedure when SN Release is confirmed by SN.\n\n  1. The MN initiates the procedure by sending the SgNB Release Request\n    message. If data forwarding is requested, the MN provides data\n    forwarding addresses to the SN.\n\n  2. The SN confirms SN Release by sending the SgNB Release Request\n    Acknowledge message. If appropriate, the SN may reject SN Release, e.g.\n    if the SN change procedure is triggered by the SN.\n\n  3/4. If required, the MN indicates in the RRCConnectionReconfiguration\n    message towards the UE that the UE shall release the entire SCG\n    configuration. In case the UE is unable to comply with (part of) the\n    configuration included in the RRCConnectionReconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  NOTE 1:  If data forwarding is applied, timely coordination between steps\n         1 and 2 may minimize gaps in service provision, this is however\n         regarded to be an implementation matter.\n\n  5. If the released bearers use RLC AM, the SN sends the SN Status\n    transfer.\n\n  6. Data forwarding from the SN to the MN takes place.\n\n  7. The SN sends the Secondary RAT Data Volume Report message to the MN\n    and includes the data volumes delivered to the UE over the NR radio for\n    the related E-RABs.\n\n  NOTE 2:  The order the SN sends the Secondary RAT Data Volume Report\n         message and performs data forwarding with MN is not defined. The SN\n         may send the report when the transmission of the related bearer is\n         stopped.\n\n  8. If applicable, the path update procedure is initiated.\n\n  9. Upon reception of the UE Context Release message, the SN can release\n    radio and C-plane related resource associated to the UE context. Any\n    ongoing data forwarding may continue.\n\nSN initiated SN Release\n\n                                    [pic]\n\n            Figure 10.4.1-2: SN Release procedure – SN initiated\n\nFigure 10.4.1-2 shows an example signalling flow for the SN initiated\nSecondary Node Release procedure.\n\n  1. The SN initiates the procedure by sending the SgNB Release Required\n    message which does not contain inter-node message.\n\n  2. If data forwarding is requested, the MN provides data forwarding\n    addresses to the SN in the SgNB Release Confirm message. The SN may\n    start data forwarding and stop providing user data to the UE as early\n    as it receives the SgNB Release Confirm message.\n\n  3/4. If required, the MN indicates in the RRCConnectionReconfiguration\n    message towards the UE that the UE shall release the entire SCG\n    configuration. In case the UE is unable to comply with (part of) the\n    configuration included in the RRCConnectionReconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  NOTE 3:  If data forwarding is applied, timely coordination between steps\n         2 and 3 may minimize gaps in service provision. This is however\n         regarded to be an implementation matter.\n\n  5. If the released bearers use RLC AM, the SN sends the SN Status\n    transfer.\n\n  6. Data forwarding from the SN to the MN takes place.\n\n  7. The SN sends the Secondary RAT Data Volume Report message to the MN\n    and includes the data volumes delivered to the UE over the NR radio for\n    the related E-RABs.\n\n  NOTE 4:  The order the SN sends the Secondary RAT Data Volume Report\n         message and performs data forwarding with MN is not defined. The SN\n         may send the report when the transmission of the related bearer is\n         stopped.\n\n  8. If applicable, the path update procedure is initiated.\n\n  9. Upon reception of the UE Context Release message, the SN can release\n    radio and C-plane related resource associated to the UE context. Any\n    ongoing data forwarding may continue.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.4.2", "title_level": 2, "desc": "10.4.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nThe SN Release procedure may be initiated either by the MN or by the SN and\nis used to initiate the release of the UE context and relevant resources at\nthe SN. The recipient node of this request can reject it, e.g., if a SN\nchange procedure is triggered by the SN.\n\nMN initiated SN Release\n\n                                    [pic]\n\n            Figure 10.4.2-1: SN release procedure - MN initiated\n\nFigure 10.4.2-1 shows an example signalling flow for the MN initiated SN\nRelease procedure.\n\n  1. The MN initiates the procedure by sending the SN Release Request\n    message. If data forwarding is requested, the MN provides data\n    forwarding addresses to the SN.\n\n  2. The SN confirms SN Release by sending the SN Release Request\n    Acknowledge message. If appropriate, the SN may reject SN Release,\n    e.g., if the SN change procedure is triggered by the SN.\n\n  3/4. If required, the MN indicates in the MN RRC reconfiguration message\n    towards the UE that the UE shall release the entire SCG configuration.\n    In case the UE is unable to comply with (part of) the configuration\n    included in the MN RRC reconfiguration message, it performs the\n    reconfiguration failure procedure.\n\n  NOTE 1:  If data forwarding is applied, timely coordination between steps\n         1 and 2 may minimize gaps in service provision, this is however\n         regarded to be an implementation matter.\n\n  5. If the released bearers use RLC AM, the SN sends the SN Status\n    transfer.\n\n  6. Data forwarding from the SN to the MN takes place.\n\n  7. If applicable, the PDU Session path update procedure is initiated.\n\n  8. Upon reception of the UE Context Release message, the SN can release\n    radio and C-plane related resource associated to the UE context. Any\n    ongoing data forwarding may continue.\n\nSN initiated SN Release\n\n                                    [pic]\n\n            Figure 10.4.2-2: SN release procedure - SN initiated\n\nFigure 10.4.2-2 shows an example signalling flow for the SN initiated SN\nRelease procedure.\n\n  1. The SN initiates the procedure by sending the SN Release Required\n    message which does not contain any inter-node message.\n\n  2. If data forwarding is requested, the MN provides data forwarding\n    addresses to the SN in the SN Release Confirm message. The SN may start\n    data forwarding and stop providing user data to the UE as early as it\n    receives the SN Release Confirm message.\n\n  3/4. If required, the MN indicates in the MN RRC reconfiguration message\n    towards the UE that the UE shall release the entire SCG configuration.\n    In case the UE is unable to comply with (part of) the configuration\n    included in the MN RRC reconfiguration message, it performs the\n    reconfiguration failure procedure.\n\n  NOTE 2:  If data forwarding is applied, timely coordination between steps\n         2 and 3 may minimize gaps in service provision. This is however\n         regarded to be an implementation matter.\n\n  5. If the released bearers use RLC AM, the SN sends the SN Status\n    transfer.\n\n  6. Data forwarding from the SN to the MN takes place.\n\n  7. If applicable, the PDU Session path update procedure is initiated.\n\n  8. Upon reception of the UE Context Release message, the SN can release\n    radio and C-plane related resource associated to the UE context. Any\n    ongoing data forwarding may continue.\n\n\n", "Keywords": "None"}, {"key": "Secondary Node Change (MN/SN initiated)", "numbering": "10.5", "title_level": 1, "desc": "10.5 Secondary Node Change (MN/SN initiated)\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.5.1", "title_level": 2, "desc": "10.5.1 EN-DC\n\nThe Secondary Node Change procedure is initiated either by MN or SN and\nused to transfer a UE context from a source SN to a target SN and to change\nthe SCG configuration in UE from one SN to another.\n\n  NOTE 1:  Inter-RAT SN change procedure with single RRC reconfiguration is\n         not supported in this version of the protocol (i.e. no transition\n         from EN-DC to DC).\n\nThe Secondary Node Change procedure always involves signalling over MCG SRB\ntowards the UE.\n\nMN initiated SN Change\n\n                                    [pic]\n\n                  Figure 10.5.1-1: SN Change – MN initiated\n\nFigure 10.5.1-1 shows an example signalling flow for the MN initiated\nSecondary Node Change:\n\n  1/2. The MN initiates the SN change by requesting the target SN to\n    allocate resources for the UE by means of the SgNB Addition procedure.\n    The MN may include measurement results related to the target SN. If\n    forwarding is needed, the target SN provides forwarding addresses to\n    the MN. The target SN includes the indication of the full or delta RRC\n    configuration.\n\n  NOTE 2:  The MN may send the SgNB Modification Request message (to the\n         source SN) to request the current SCG configuration before step 1.\n\n  3. If the allocation of target SN resources was successful, the MN\n    initiates the release of the source SN resources including a Cause\n    indicating SCG mobility. The Source SN may reject the release. If data\n    forwarding is needed the MN provides data forwarding addresses to the\n    source SN. Reception of the SgNB Release Request message triggers the\n    source SN to stop providing user data to the UE and, if applicable, to\n    start data forwarding.\n\n  4/5. The MN triggers the UE to apply the new configuration. The MN\n    indicates to the UE the new configuration in the\n    RRCConnectionReconfiguration message including the NR RRC configuration\n    message generated by the target SN. The UE applies the new\n    configuration and sends the RRCConnectionReconfigurationComplete\n    message, including the encoded NR RRC response message for the target\n    SN, if needed. In case the UE is unable to comply with (part of) the\n    configuration included in the RRCConnectionReconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  6. If the RRC connection reconfiguration procedure was successful, the MN\n    informs the target SN via SgNBReconfigurationComplete message with the\n    encoded NR RRC response message for the target SN, if received from the\n    UE.\n\n  7. If configured with bearers requiring SCG radio resources, the UE\n    synchronizes to the target SN.\n\n  8. For SN terminated bearers using RLC AM, the source SN sends the SN\n    Status transfer, which the MN sends then to the target SN.\n\n  9. If applicable, data forwarding from the source SN takes place. It may\n    be initiated as early as the source SN receives the SgNB Release\n    Request message from the MN.\n\n  10.  The source SN sends the Secondary RAT Data Volume Report message to\n    the MN and includes the data volumes delivered to the UE over the NR\n    radio for the related E-RABs.\n\n  NOTE 3:  The order the SN sends the Secondary RAT Data Volume Report\n         message and performs data forwarding with MN is not defined. The SN\n         may send the report when the transmission of the related bearer is\n         stopped.\n\n  11-15. If one of the bearer was terminatedat the source SN, path update\n    is triggered by the MN.\n\n  16.  Upon reception of the UE Context Release message, the source SN can\n    release radio and C-plane related resource associated to the UE\n    context. Any ongoing data forwarding may continue.\n\nSN initiated SN Change\n\n                                    [pic]\n\n                  Figure 10.5.1-2: SN Change – SN initiated\n\nFigure 10.5.1-2 shows an example signalling flow for the Secondary Node\nChange initiated by the SN:\n\n  1. The source SN initiates the SN change procedure by sending SgNB Change\n    Required message which contains target SN ID information and may\n    include the SCG configuration (to support delta configuration) and\n    measurement results related to the target SN.\n\n  2/3. The MN requests the target SN to allocate resources for the UE by\n    means of the SgNB Addition procedure, including the measurement results\n    related to the target SN received from the source SN. If forwarding is\n    needed, the target SN provides forwarding addresses to the MN. The\n    target SN includes the indication of the full or delta RRC\n    configuration.\n\n  4/5. The MN triggers the UE to apply the new configuration. The MN\n    indicates the new configuration to the UE in the\n    RRCConnectionReconfiguration message including the NR RRC configuration\n    message generated by the target SN. The UE applies the new\n    configuration and sends the RRCConnectionReconfigurationComplete\n    message, including the encoded NR RRC response message for the target\n    SN, if needed. In case the UE is unable to comply with (part of) the\n    configuration included in the RRCConnectionReconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  6. If the allocation of target SN resources was successful, the MN\n    confirms the release of the source SN resources. If data forwarding is\n    needed the MN provides data forwarding addresses to the source SN.\n    Reception of the SgNB Change Confirm message triggers the source SN to\n    stop providing user data to the UE and, if applicable, to start data\n    forwarding.\n\n  7. If the RRC connection reconfiguration procedure was successful, the MN\n    informs the target SN via SgNB Reconfiguration Complete message with\n    the encoded NR RRC response message for the target SN, if received from\n    the UE.\n\n  8. The UE synchronizes to the target SN.\n\n  9. For SN terminated bearers using RLC AM, the source SN sends the SN\n    Status transfer, which the MN sends then to the target SN.\n\n  10.  If applicable, data forwarding from the source SN takes place. It\n    may be initiated as early as the source SN receives the SgNB Change\n    Confirm message from the MN.\n\n  11.  The source SN sends the Secondary RAT Data Volume Report message to\n    the MN and includes the data volumes delivered to the UE over the NR\n    radio for the related E-RABs.\n\n  NOTE 4:  The order the source SN sends the Secondary RAT Data Volume\n         Report message and performs data forwarding with MN/target SN is\n         not defined. The SgNB may send the report when the transmission of\n         the related bearer is stopped.\n\n  12-16. If one of the bearer was terminated at the source SN, path update\n    is triggered by the MN.\n\n  17.  Upon reception of the UE Context Release message, the source SN can\n    release radio and C-plane related resource associated to the UE\n    context. Any ongoing data forwarding may continue.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.5.2", "title_level": 2, "desc": "10.5.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nMN initiated SN Change\n\nThe MN initiated SN change procedure is used to transfer a UE context from\nthe source SN to a target SN and to change the SCG configuration in UE from\none SN to another.\n\nThe Secondary Node Change procedure always involves signalling over MCG SRB\ntowards the UE.\n\n                                    [pic]\n\n             Figure 10.5.2-1: SN change procedure - MN initiated\n\nFigure 10.5.2-1 shows an example signalling flow for the SN Change\ninitiated by the MN:\n\n  1/2. The MN initiates the SN change by requesting the target SN to\n    allocate resources for the UE by means of the SN Addition procedure.\n    The MN may include measurement results related to the target SN. If\n    data forwarding is needed, the target SN provides data forwarding\n    addresses to the MN. The target SN includes the indication of the full\n    or delta RRC configuration.\n\n  NOTE:  The MN may send the SN Modification Request message (to the source\n         SN) to request the current SCG configuration before step 1.\n\n  3. If the allocation of target SN resources was successful, the MN\n    initiates the release of the source SN resources including a Cause\n    indicating SCG mobility. The Source SN may reject the release. If data\n    forwarding is needed the MN provides data forwarding addresses to the\n    source SN. Reception of the SN Release Request message triggers the\n    source SN to stop providing user data to the UE and, if applicable, to\n    start data forwarding.\n\n  4/5. The MN triggers the UE to apply the new configuration. The MN\n    indicates the new configuration to the UE in the MN RRC reconfiguration\n    message including the target SN RRC configuration message. The UE\n    applies the new configuration and sends the MN RRC reconfiguration\n    complete message, including the encoded SN RRC response message for the\n    target SN, if needed. In case the UE is unable to comply with (part of)\n    the configuration included in the MN RRC reconfiguration message, it\n    performs the reconfiguration failure procedure.\n\n  6. If the RRC connection reconfiguration procedure was successful, the MN\n    informs the target SN via SN Reconfiguration Complete message with the\n    encoded SN RRC response message for the target SN, if received from the\n    UE.\n\n  7. If configured with bearers requiring SCG radio resources the UE\n    synchronizes to the target SN.\n\n  8. For SN terminated bearers using RLC AM, the source SN sends the SN\n    Status transfer, which the MN sends then to the target SN.\n\n  9. If applicable, data forwarding from the source SN takes place. It may\n    be initiated as early as the source SN receives the SN Release Request\n    message from the MN.\n\n  10-14. If one of the PDU session/QoS Flow was terminated at the source\n    SN, path update procedure is triggered by the MN.\n\n  15.  Upon reception of the UE Context Release message, the source SN can\n    release radio and C-plane related resource associated to the UE\n    context. Any ongoing data forwarding may continue\n\nSN initiated SN Change\n\nThe SN initiated SN change procedure is used to transfer a UE context from\nthe source SN to a target SN and to change the SCG configuration in UE from\none SN to another.\n\n                                    [pic]\n\n             Figure 10.5.2-2: SN change procedure - SN initiated\n\nFigure 10.5.2-2 shows an example signalling flow for the SN Change\ninitiated by the SN:\n\n  1. The source SN initiates the SN change procedure by sending the SN\n    Change Required message, which contains a candidate target node ID and\n    may include the SCG configuration (to support delta configuration) and\n    measurement results related to the target SN.\n\n  2/3. The MN requests the target SN to allocate resources for the UE by\n    means of the SN Addition procedure, including the measurement results\n    related to the target SN received from the source SN. If data\n    forwarding is needed, the target SN provides data forwarding addresses\n    to the MN. The target SN includes the indication of the full or delta\n    RRC configuration.\n\n  4/5. The MN triggers the UE to apply the new configuration. The MN\n    indicates the new configuration to the UE in the MN RRC reconfiguration\n    message including the SN RRC configuration message generated by the\n    target SN. The UE applies the new configuration and sends the MN RRC\n    reconfiguration complete message, including the encoded SN RRC response\n    message for the target SN, if needed. In case the UE is unable to\n    comply with (part of) the configuration included in the MN RRC\n    reconfiguration message, it performs the reconfiguration failure\n    procedure.\n\n  6. If the allocation of target SN resources was successful, the MN\n    confirms the change of the source SN. If data forwarding is needed the\n    MN provides data forwarding addresses to the source SN. Reception of\n    the SN Change Confirm message triggers the source SN to stop providing\n    user data to the UE and, if applicable, to start data forwarding.\n\n  7. If the RRC connection reconfiguration procedure was successful, the MN\n    informs the target SN via SN Reconfiguration Complete message with the\n    encoded SN RRC response message for the target SN, if received from the\n    UE.\n\n  8. The UE synchronizes to the target SN.\n\n  9. For SN terminated bearers using RLC AM, the source SN sends the SN\n    Status transfer, which the MN sends then to the target SN.\n\n  10.  If applicable, data forwarding from the source SN takes place. It\n    may be initiated as early as the source SN receives the SN Change\n    Confirm message from the MN.\n\n  11-15. If one of the PDU session/QoS Flow was terminated at the source\n    SN, path update procedure is triggered by the MN.\n\n  16.  Upon reception of the UE Context Release message, the source SN can\n    release radio and C-plane related resource associated to the UE\n    context. Any ongoing data forwarding may continue.\n\n\n", "Keywords": "None"}, {"key": "PSCell change", "numbering": "10.6", "title_level": 1, "desc": "10.6 PSCell change\n\nIn MR-DC, a PSCell change does not always require a security key change.\n\nIf a security key change is required, this is performed through a\nsynchronous SCG reconfiguration procedure towards the UE involving random\naccess on PSCell and a security key change, during which the MAC entity\nconfigured for SCG is reset and RLC configured for SCG is re-established\nregardless of the bearer type(s) established on SCG. For SN terminated\nbearers, PDCP is re-established. In EN-DC, to perform this procedure within\nthe same SN, the SN Modification procedure as described in section 10.3 is\nused, setting the PDCP Change Indication to indicate that a S-KgNB update\nis required when the procedure is initiated by the SN or including the SgNB\nSecurity Key when the procedure is initiated by the MN.\n\nIf a security key change is not required, this is performed through a\nsynchronous SCG reconfiguration procedure without security key change\ntowards the UE involving random access on PSCell, during which the MAC\nentity configured for SCG is reset and RLC configured for SCG is re-\nestablished regardless of the bearer type(s) established on SCG. for\nbearers using RLC AM mode PDCP data recovery applies, for bearers using RLC\nUM no action is performed in PDCP while for SRBs PDCP discards all stored\nSDUs and PDUs. In EN-DC, unless MN terminated SCG or split bearers are\nconfigured, this does not require MN involvement. In case of MN terminated\nSCG or split bearers, the SN initiated SN Modification procedure as\ndescribed in section 10.3 is used, setting the PDCP Change Indication to\nindicate that a PDCP data recovery is required.\n\n\n", "Keywords": "None"}, {"key": "Inter-Master Node handover with/without Secondary Node change", "numbering": "10.7", "title_level": 1, "desc": "10.7 Inter-Master Node handover with/without Secondary Node change\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.7.1", "title_level": 2, "desc": "10.7.1 EN-DC\n\n\nInter-Master Node handover with/without MN initiated Secondary Node change\nis used to transfer context data from a source MN to a target MN while the\ncontext at the SN is kept or moved to another SN. During an Inter-Master\nNode handover, the target MN decides whether to keep or change the SN (or\nrelease the SN, as described in section 10.8).\n\n\n  NOTE 1:  Inter-RAT Inter-Master node handover with/without SN change is\n         not supported in this version of the protocol (i.e. no transition\n         from EN-DC to NR-NR DC).\n\n\n                                    [pic]\n\n\n   Figure 10.7.1-1: Inter-MN handover with/without MN initiated SN change\n\n\nFigure 10.7.1-1 shows an example signaling flow for inter-Master Node\nhandover with or without MN initiated Secondary Node change:\n\n  NOTE 2:  For an inter-Master Node handover without Secondary Node change,\n         the source SN and the target SN shown in Figure 10.7.1-1 are the\n         same node.\n\n  1. The source MN starts the handover procedure by initiating the X2\n    Handover Preparation procedure including both MCG and SCG\n    configuration. The source MN includes the (source) SN UE X2AP ID, SN ID\n    and the UE context in the (source) SN in the Handover Request message.\n\n  NOTE 3:  The source MN may send the SgNB Modification Request message (to\n         the source SN) to request the current SCG configuration before step\n         1.\n\n  2. If the target MN decides to keep the SN, the target MN sends SN\n    Addition Request to the SN including the SN UE X2AP ID as a reference\n    to the UE context in the SN that was established by the source MN. If\n    the target MN decides to change the SN, the target MN sends the SgNB\n    Addition Request to the target SN including the UE context in the\n    source SN that was established by the source MN.\n\n  3. The (target) SN replies with SN Addition Request Acknowledge.\n\n  4. The target MN includes within the Handover Request Acknowledge message\n    a transparent container to be sent to the UE as an RRC message to\n    perform the handover, and may also provide forwarding addresses to the\n    source MN. The target MN indicates to the source MN that the UE context\n    in the SN is kept if the target MN and the SN decided to keep the UE\n    context in the SN in step 2 and step 3.\n\n  5. The source MN sends SN Release Request to the (source) SN including a\n    Cause indicating MCG mobility. The (source) SN acknowledges the release\n    request. The source MN indicates to the (source) SN that the UE context\n    in SN is kept, if it receives the indication from the target MN. If the\n    indication as the UE context kept in SN is included, the SN keeps the\n    UE context.\n\n  6. The source MN triggers the UE to apply the new configuration.\n\n  7/8. The UE synchronizes to the target MN and replies with\n    RRCConnectionReconfigurationComplete message.\n\n  9. If configured with bearers requiring SCG radio resources, the UE\n    synchronizes to the (target) SN.\n\n  10.  If the RRC connection reconfiguration procedure was successful, the\n    target MN informs the (target) SN via SgNB Reconfiguration Complete\n    message.\n\n  11a. The SN sends the Secondary RAT Data Volume Report message to the\n    source MN and includes the data volumes delivered to the UE over the NR\n    radio for the related E-RABs.\n\n  NOTE 4:  The order the source SN sends the Secondary RAT Data Volume\n         Report message and performs data forwarding with MN/target SN is\n         not defined. The SgNB may send the report when the transmission of\n         the related bearer is stopped.\n\n  11b. The source MN sends the Secondary RAT Report message to MME to\n    provide information on the used NR resource.\n\n  12.  For bearers using RLC AM, the source MN sends the SN Status transfer\n    to the target MN.\n\n  13.  Data forwarding from the source MN takes place. If the SN is kept,\n    data forwarding may be omitted for SCG bearers and SCG split bearers.\n\n  14-17. The target MN initiates the S1 Path Switch procedure.\n\n  NOTE 5:  If new UL TEIDs of the S-GW are included, the target MN performs\n         MN initiated SN Modification procedure to provide them to the SN.\n\n  18.  The target MN initiates the UE Context Release procedure towards the\n    source MN.\n\n  19.  Upon reception of the UE Context Release message, the (source) SN\n    can release C-plane related resource associated to the UE context\n    towards the source MN. Any ongoing data forwarding may continue. The SN\n    shall not release the UE context associated with the target MN if the\n    indication was included in the SN Release Request in step 5.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.7.2", "title_level": 2, "desc": "10.7.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\n\nInter-MN handover with/without MN initiated SN change is used to transfer\nUE context data from a source MN to a target MN while the UE context at the\nSN is kept or moved to another SN. During an Inter-Master Node handover,\nthe target MN decides whether to keep or change the SN (or release the SN,\nas described in section 10.8).\n\n\n                                    [pic]\n\n\n   Figure 10.7.2-1: Inter-MN handover with/without MN initiated SN change\n                                  procedure\n\n\nFigure 10.7.2-1 shows an example signalling flow for inter-MN handover with\nor without MN initiated SN change:\n\n  NOTE 1:  For an inter-Master Node handover without Secondary Node change,\n         the source SN and the target SN shown in Figure 10.7.2-1 are the\n         same node.\n\n  1. The source MN starts the handover procedure by initiating the Xn\n    Handover Preparation procedure including both MCG and SCG\n    configuration. The source MN includes the source SN UE XnAP ID, SN ID\n    and the UE context in the source SN in the Handover Request message.\n\n  NOTE 2:  The source MN may send the SN Modification Request message (to\n         the source SN) to request the current SCG configuration before step\n         1.\n\n  2. If the target MN decides to keep the source SN, the target MN sends SN\n    Addition Request to the SN including the SN UE XnAP ID as a reference\n    to the UE context in the SN that was established by the source MN. If\n    the target MN decides to change the SN, the target MN sends the SN\n    Addition Request to the target SN including the UE context in the\n    source SN that was established by the source MN.\n\n  3. The (target) SN replies with SN Addition Request Acknowledge.\n\n  4. The target MN includes within the Handover Request Acknowledge message\n    a transparent container to be sent to the UE as an RRC message to\n    perform the handover, and may also provide forwarding addresses to the\n    source MN. The target MN indicates to the source MN that the UE context\n    in the SN is kept if the target MN and the SN decided to keep the UE\n    context in the SN in step 2 and step 3.\n\n  5. The source MN sends SN Release Request message to the (source) SN\n    including a Cause indicating MCG mobility. The (source) SN acknowledges\n    the release request. The source MN indicates to the (source) SN that\n    the UE context in SN is kept, if it receives the indication from the\n    target MN. If the indication as the UE context kept in SN is included,\n    the SN keeps the UE context.\n\n  6. The source MN triggers the UE to perform handover and apply the new\n    configuration.\n\n  7/8. The UE synchronizes to the target MN and replies with MN RRC\n    reconfiguration complete message.\n\n  9. If configured with bearers requiring SCG radio resources, the UE\n    synchronizes to the (target) SN.\n\n  10.  If the RRC connection reconfiguration procedure was successful, the\n    target MN informs the (target) SN via SN Reconfiguration Complete\n    message.\n\n  11.  For bearers using RLC AM, the source MN sends the SN Status transfer\n    to the target MN.\n\n  12.  Data forwarding from the source MN takes place. If the SN is kept,\n    data forwarding may be omitted for SCG bearers and SCG split bearers.\n\n  13-16. The target MN initiates the PDU Session Path Switch procedure.\n\n  NOTE 3:  If new UL TEIDs of the UPF for SN are included, the target MN\n         performs MN initiated SN Modification procedure to provide them to\n         the SN.\n\n  17.  The target MN initiates the UE Context Release procedure towards the\n    source MN.\n\n  18.  Upon reception of the UE Context Release message from source MN, the\n    (source) SN can release C-plane related resource associated to the UE\n    context towards the source MN. Any ongoing data forwarding may\n    continue. The SN shall not release the UE context associated with the\n    target MN if the indication was included in the SN Release Request\n    message in step 5.\n\n\n", "Keywords": "None"}, {"key": "Master Node to eNB/gNB Change", "numbering": "10.8", "title_level": 1, "desc": "10.8 Master Node to eNB/gNB Change\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.8.1", "title_level": 2, "desc": "10.8.1 EN-DC\n\nThe Master Node to eNB Change procedure is used to transfer context data\nfrom a source MN/SN to a target eNB.\n\n                                    [pic]\n\n            Figure 10.8.1-1: Master Node to eNB Change procedure\n\nFigure 10.8.1-1 shows an example signalling flow for the Master Node to eNB\nChange procedure:\n\n  1. The source MN starts the MN to eNB Change procedure by initiating the\n    X2 Handover Preparation procedure, including both MCG and SCG\n    configuration.\n\n  NOTE 1:  The source MN may send the SgNB Modification Request message (to\n         the source SN) to request the current SCG configuration before step\n         1.\n\n  2. The target eNB includes the field in HO command which releases SCG\n    configuration, and may also provide forwarding addresses to the source\n    MN.\n\n  3. If the allocation of target eNB resources was successful, the MN\n    initiates the release of the source SN resources towards the source SN\n    including a Cause indicating MCG mobility. The SN acknowledges the\n    release request. If data forwarding is needed, the MN provides data\n    forwarding addresses to the source SN. Reception of the SgNB Release\n    Request message triggers the source SN to stop providing user data to\n    the UE and, if applicable, to start data forwarding.\n\n  4. The MN triggers the UE to apply the new configuration. Upon receiving\n    the new configuration, the UE releases the entire SCG configuration.\n\n  5/6. The UE synchronizes to the target eNB.\n\n  7. For SN terminated bearers using RLC AM, the SN sends the SN Status\n    transfer, which the source MN sends then to the target eNB.\n\n  8. If applicable, data forwarding from the source SN takes place. It may\n    start as early as the source SN receives the SgNB Release Request\n    message from the MN.\n\n  9a.  The source SN sends the Secondary RAT Data Volume Report message to\n    the source MN and includes the data volumes delivered to the UE over\n    the NR radio for the related E-RABs.\n\n  NOTE 2:  The order the SN sends the Secondary RAT Data Volume Report\n         message and performs data forwarding with MN is not defined. The SN\n         may send the report when the transmission of the related bearer is\n         stopped.\n\n  9b.  The source MN sends the Secondary RAT Report message to MME to\n    provide information on the used NR resource.\n\n  10-14. The target eNB initiates the S1 Path Switch procedure.\n\n  15.  The target eNB initiates the UE Context Release procedure towards\n    the source MN.\n\n  16.  Upon reception of the UE CONTEXT RELEASE message, the S-SN can\n    release radio and C-plane related resource associated to the UE\n    context. Any ongoing data forwarding may continue.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.8.2", "title_level": 2, "desc": "10.8.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nThe MN to ng-eNB/gNB Change procedure is used to transfer UE context data\nfrom a source MN/SN to a target ng-eNB/gNB.\n\n                                    [pic]\n\n             Figure 10.8.2-1: MN to ng-eNB/gNB Change procedure\n\nFigure 10.8.2-1 shows an example signalling flow for the MN to ng-eNB/gNB\nChange procedure:\n\n  1. The source MN starts the MN to ng-eNB/gNB Change procedure by\n    initiating the Xn Handover Preparation procedure, including both MCG\n    and SCG configuration.\n\n  NOTE:  The source MN may send the SN Modification Request message (to the\n         source SN) to request the current SCG configuration before step 1.\n\n  2. The target ng-eNB/gNB includes the field in HO command which releases\n    the SCG configuration, and may also provide forwarding addresses to the\n    source MN.\n\n  3. If the resource allocation of target ng-eNB/gNB was successful, the MN\n    initiates the release of the source SN resources towards the source SN\n    including a Cause indicating MCG mobility. The SN acknowledges the\n    release request. If data forwarding is needed, the MN provides data\n    forwarding addresses to the source SN. Reception of the SN Release\n    Request message triggers the source SN to stop providing user data to\n    the UE and, if applicable, to start data forwarding.\n\n  4. The MN triggers the UE to perform HO and apply the new configuration.\n    Upon receiving the new configuration, the UE releases the entire SCG\n    configuration.\n\n  5/6. The UE synchronizes to the target ng-eNB/gNB.\n\n  7. For SN terminated bearers using RLC AM, the SN sends the SN Status\n    transfer, which the source MN sends then to the target ng-eNB/gNB.\n\n  8. If applicable, data forwarding from the source SN takes place. It may\n    start as early as the source SN receives the SN Release Request message\n    from the MN.\n\n  9-13.  The target ng-eNB/gNB initiates the PDU Session Path Switch\n    procedure.\n\n  14.  The target ng-eNB/gNB initiates the UE Context Release procedure\n    towards the source MN.\n\n  15.  Upon reception of the UE Context Release message from MN, the source\n    SN can release radio and C-plane related resource associated to the UE\n    context. Any ongoing data forwarding may continue.\n\n\n", "Keywords": "None"}, {"key": "eNB/gNB to Master Node change", "numbering": "10.9", "title_level": 1, "desc": "10.9 eNB/gNB to Master Node change\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.9.1", "title_level": 2, "desc": "10.9.1 EN-DC\n\nThe eNB to Master Node change procedure is used to transfer context data\nfrom a source eNB to a target MN that adds an SN during the handover.\n\n                                    [pic]\n\n                 Figure 10.9.1-1: eNB to Master Node change\n\nFigure 10.9.1-1 shows an example signaling flow for eNB to Master Node\nchange:\n\n  1. The source eNB starts the handover procedure by initiating the X2\n    Handover Preparation procedure.\n\n  2. The target MN sends SgNB Addition Request to the target SN.\n\n  3. The target SN replies with SgNB Addition Request Acknowledge. If data\n    forwarding is needed, the target SN provides forwarding addresses to\n    the target MN.\n\n  4. The target MN includes within the Handover Request Acknowledge message\n    a transparent container to be sent to the UE as an E-UTRA RRC message,\n    including a NR RRC configuration message which also includes the SCG\n    configuration, to perform the handover, and may also provide forwarding\n    addresses to the source eNB.\n\n  5. The source eNB triggers the UE to apply the new configuration.\n\n  6/7. The UE synchronizes to the target MN and replies with\n    RRCConnectionReconfigurationComplete message.\n\n  8. The UE synchronizes to the target SN\n\n  9. If the RRC connection reconfiguration procedure was successful, the\n    target MN informs the target SN.\n\n  10.  For bearers using RLC AM, the source eNB sends the SN Status\n    transfer to the target MN.\n\n  11.  Data forwarding from the source eNB takes place.\n\n  12-15. The target MN initiates the S1 Path Switch procedure.\n\n  NOTE:  If new UL TEIDs of the S-GW are included, the target MN performs\n         MN initiated SN Modification procedure to provide them to the\n         target SN.\n\n  16.  The target MN initiates the UE Context Release procedure towards the\n    source eNB.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.9.2", "title_level": 2, "desc": "10.9.2 MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nThe ng-eNB/gNB to MN change procedure is used to transfer UE context data\nfrom a source ng-eNB/gNB to a target MN that adds an SN during the\nhandover.\n\n                                    [pic]\n\n             Figure 10.9.2-1: ng-eNB/gNB to MN change procedure\n\nFigure 10.9.2-1 shows an example signalling flow for ng-eNB/gNB to MN\nchange:\n\n  1. The source ng-eNB/gNB starts the handover procedure by initiating the\n    Xn Handover Preparation procedure.\n\n  2. The target MN sends SN Addition Request to the target SN.\n\n  3. The target SN replies with SN Addition Request Acknowledge. If data\n    forwarding is needed, the target SN provides forwarding addresses to\n    the target MN.\n\n  4. The target MN includes within the Handover Request Acknowledge message\n    a transparent container to be sent to the UE as an MN RRC message\n    including a SN RRC configuration message which also includes the SCG\n    configuration, to perform the handover, and may also provide forwarding\n    addresses to the source ng-eNB/gNB.\n\n  5. The source ng-eNB/gNB triggers the UE to perform handover and apply\n    the new configuration.\n\n  6/7. The UE synchronizes to the target MN and replies with MN RRC\n    reconfiguration complete message.\n\n  8. The UE synchronizes to the target SN .\n\n  9. If the RRC connection reconfiguration procedure was successful, the\n    target MN informs the target SN via SN Reconfiguration Complete\n    message.\n\n  10.  For bearers using RLC AM, the source ng-eNB/gNB sends the SN Status\n    transfer to the target MN.\n\n  11.  Data forwarding from the source ng-eNB/gNB takes place.\n\n  12-15. The target MN initiates the PDU Session Path Switch procedure.\n\n  NOTE:  If new UL TEIDs of the UPF are included, the target MN performs MN\n         initiated SN Modification procedure to provide them to the target\n         SN.\n\n  16.  The target MN initiates the UE Context Release procedure towards the\n    source ng-eNb/gNB.\n\n\n", "Keywords": "None"}, {"key": "RRC Transfer", "numbering": "10.10", "title_level": 1, "desc": "10.10  RRC Transfer\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.10.1", "title_level": 2, "desc": "10.10.1  EN-DC\n\nThe RRC Transfer procedure is used to exchange RRC messages between the MN\nand the UE via the SN (split SRB) and to provide NR measurement reports\nfrom the UE to the SN.\n\nSplit SRB:\n\n                                    [pic]\n\n    Figure 10.10.1-1: RRC Transfer procedure for split SRB (DL operation)\n\nFigure 10.10.1-1 shows an example signaling flow for DL RRC Transfer in\ncase of the split SRB:\n\n  1. The MN, when it decides to use the split SRBs, starts the procedure by\n    initiating the RRC Transfer procedure. The MN encapsulates the RRC\n    message in a PDCP-C PDU and ciphers with own keys.\n\n  NOTE:  The usage of the split SRBs shall be indicated in the Secondary\n         Node Addition procedure.\n\n  2. The SN forwards the RRC message to the UE.\n\n  3. The SN may send PDCP delivery acknowledgement of the RRC message\n    forwarded in step 2.\n\n                                    [pic]\n\n    Figure 10.10.1-2: RRC Transfer procedure for split SRB (UL operation)\n\nFigure 10.10.1-2 shows an example signaling flow for UL RRC Transfer in\ncase of the split SRB:\n\n  1. When the UE provides response to the RRC message, it sends it to the\n    SN.\n\n  2. The SN initiates the RRC Transfer procedure, in which it transfers the\n    received PDCP-C PDU with encapsulated RRC message.\n\nNR measurement report:\n\n                                    [pic]\n\n     Figure 10.10.1-3: RRC Transfer procedure for NR measurement report\n\nFigure 10.10.1-3 shows an example signaling flow for RRC Transfer in case\nof the forwarding of the NR measurement report from the UE:\n\n  1. When the UE sends a measurement report, it sends it to the MN in the\n    GenericContainer.\n\n  2. The MN initiates the RRC Transfer procedure, in which it transfers the\n    received NR measurement report as an octet string.\n\n\n", "Keywords": "None"}, {"key": "MR-DC with 5GC", "numbering": "10.10.2", "title_level": 2, "desc": "10.10.2  MR-DC with 5GC\n\nEditor's note: MR-DC with the 5GC is not complete and is targeted for\ncompletion in December 2018.\n\nThe RRC Transfer procedure is used to exchange RRC messages between the MN\nand the UE via the SN (split SRB) and to provide NR measurement reports\nfrom the UE to the SN.\n\nSplit SRB:\n\n\n\n                                    [pic]\n\n    Figure 10.10.2-1: RRC Transfer procedure for split SRB (DL operation)\n\nFigure 10.10.2-1 shows an example signaling flow for DL RRC Transfer in\ncase of the split SRB:\n\n  1. The MN, when it decides to use the split SRBs, starts the procedure by\n    initiating the RRC Transfer procedure. The MN encapsulates the RRC\n    message in a PDCP-C PDU and ciphers with own keys.\n\n  NOTE:  The usage of the split SRBs shall be indicated in the Secondary\n         Node Addition procedure.\n\n  2. The SN forwards the RRC message to the UE.\n\n  3. The SN may send PDCP delivery acknowledgement of the RRC message\n    forwarded in step 2.\n\n                                    [pic]\n\n    Figure 10.10.2-2: RRC Transfer procedure for split SRB (UL operation)\n\nFigure 10.10.2-2 shows an example signaling flow for UL RRC Transfer in\ncase of the split SRB:\n\n  1. When the UE provides response to the RRC message, it sends it to the\n    SN.\n\n  2. The SN initiates the RRC Transfer procedure, in which it transfers the\n    received PDCP-C PDU with encapsulated RRC message.\n\nNR measurement report:\n\n                                    [pic]\n\n     Figure 10.10.2-3: RRC Transfer procedure for NR measurement report\n\nFigure 10.10.2-3 shows an example signaling flow for RRC Transfer in case\nof the forwarding of the NR measurement report from the UE:\n\n  1. When the UE sends a measurement report, it sends it to the MN in the\n    GenericContainer.\n\n  2. The MN initiates the RRC Transfer procedure, in which it transfers the\n    received NR measurement report as an octet string.\n\n\n", "Keywords": "None"}, {"key": "Secondary RAT data volume reporting", "numbering": "10.11", "title_level": 1, "desc": "10.11  Secondary RAT data volume reporting\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.11.1", "title_level": 2, "desc": "10.11.1  EN-DC\n\nThe secondary RAT data volume reporting function is used to report the data\nvolume of secondary RAT to CN. In EN-DC, if configured, the MN reports the\nuplink and downlink data volumes of SN to the EPC on a per EPS bearer basis\nas specified in TS 36.300 [2]. Periodic reporting is performed\nby periodically sending the Secondary RAT Data Volume Report messages from\na SN to a MN, and then to a MME.\n\n                                    [pic]\n\n       Figure 10.11.1-1: Secondary RAT data volume periodic reporting\n\nFigure 10.11.1-1 shows an example signalling flow for secondary RAT data\nvolume periodic reporting:\n\n  1. If the periodic reporting is configured, then the SN periodically\n    sends the Secondary RAT Data Volume Report message to the MN and\n    includes the data volumes delivered to the UE over the NR radio for the\n    related E-RABs.\n\n  2. The MN sends the Secondary RAT Report message to MME to provide\n    information on the used NR resource.\n\n\n", "Keywords": "None"}, {"key": "Activity Notification", "numbering": "10.12", "title_level": 1, "desc": "10.12  Activity Notification\n\n\n", "Keywords": "None"}, {"key": "EN-DC", "numbering": "10.12.1", "title_level": 2, "desc": "10.12.1  EN-DC\n\nThe Activity Notification function is used to report user plane activity\nwithin SN resources. It can either report inactivity or resumption of\nactivity after inactivity was reported. In EN-DC the Activity Reporting is\nprovided from the SN only. The MN may take further actions.\n\n                                    [pic]\n\n         Figure 10.12.1-1: Support of Activity Notification in EN-DC\n\nSupport of Activity Notification in EN-DC is used to keep the MN informed\nabout user traffic activity in resources owned by the SN. The MN may take\nappropriate action upon receiving such notification.\n\n  1. The SN informs the MN about user data inactivity of resources owned by\n    the SN.\n\n  2. The MN decides to keep SN resources.\n\n  3. After a while the SN reports resumption of user plane activitiy.\n\n\n", "Keywords": "None"}, {"key": "Service related aspects", "numbering": "11", "title_level": 0, "desc": "11 Service related aspects\n\n\n", "Keywords": "None"}, {"key": "Roaming and Access Restrictions", "numbering": "11.1", "title_level": 1, "desc": "11.1 Roaming and Access Restrictions\n\nThe principles for conveying roaming and access restriction info for EN-DC\nare described in TS 36.300 [2].\n\nFor MR-DC with 5GC, SCG (re)selection at the SN is based on roaming and\naccess restriction information in SN. If roaming and access restriction\ninformation is not available at the SN, the SN shall consider that there is\nno restriction for SCG (re)selection. Therefore, MN needs to convey the up-\nto-date roaming and access restriction information to SN via XnAP messages.\n\n\n", "Keywords": "None"}, {"key": "X2/Xn Interface related aspects", "numbering": "12", "title_level": 0, "desc": "", "Keywords": "None"}, {"key": "En-gNB", "desc": "node providing NR user plane and control plane protocol\nterminations towards the UE, and acting as Secondary Node in EN-DC.", "numbering": "3.1", "Keywords": "None"}, {"key": "Master Cell Group", "desc": "in MR-DC, a group of serving cells associated with the\nMaster Node, comprising of the SpCell (Pcell) and optionally one or more\nScells.", "numbering": "3.1", "Keywords": "None"}, {"key": "Master node", "desc": "A Master eNB (in EN-DC), Master ng-eNB (in NGEN-DC) or a\nMaster gNB (in NE-DC).", "numbering": "3.1", "Keywords": "None"}, {"key": "MCG bearer", "desc": "in MR-DC, a radio bearer with an RLC bearer only in the MCG.", "numbering": "3.1", "Keywords": "None"}, {"key": "MN terminated bearer", "desc": "in MR-DC, a radio bearer for which PDCP is located in\nthe MN.", "numbering": "3.1", "Keywords": "None"}, {"key": "MCG SRB", "desc": "in MR-DC, a direct SRB between the MN and the UE.", "numbering": "3.1", "Keywords": "None"}, {"key": "Multi-RAT Dual Connectivity", "desc": "Dual Connectivity between E-UTRA and NR nodes.", "numbering": "3.1", "Keywords": "None"}, {"key": "Ng-eNB", "desc": "as defined in TS 38.300 [3].", "numbering": "3.1", "Keywords": "None"}, {"key": "PCell", "desc": "SpCell of a master cell group.", "numbering": "3.1", "Keywords": "None"}, {"key": "PSCell", "desc": "SpCell of a secondary cell group.", "numbering": "3.1", "Keywords": "None"}, {"key": "RLC bearer", "desc": "RLC and MAC logical channel configuration of a radio bearer in\none cell group.", "numbering": "3.1", "Keywords": "None"}, {"key": "Secondary Cell Group", "desc": "in MR-DC, a group of serving cells associated with\nthe Secondary Node, comprising of the SpCell (PSCell) and optionally one or\nmore Scells.", "numbering": "3.1", "Keywords": "None"}, {"key": "Secondary node", "desc": "An en-gNB (in EN-DC), Secondary ng-eNB (in NE-DC) or a\nSecondary gNB (in NGEN-DC).", "numbering": "3.1", "Keywords": "None"}, {"key": "SCG bearer", "desc": "in MR-DC, a radio bearer with an RLC bearer only in the SCG.", "numbering": "3.1", "Keywords": "None"}, {"key": "SN terminated bearer", "desc": "in MR-DC, a radio bearer for which PDCP is located in\nthe SN.", "numbering": "3.1", "Keywords": "None"}, {"key": "SpCell", "desc": "primary cell of a master or secondary cell group.", "numbering": "3.1", "Keywords": "None"}, {"key": "SRB3", "desc": "in EN-DC and NGEN-DC, a direct SRB between the SN and the UE.", "numbering": "3.1", "Keywords": "None"}, {"key": "Split bearer", "desc": "in MR-DC, a radio bearer with RLC bearers both in MCG and\nSCG.", "numbering": "3.1", "Keywords": "None"}, {"key": "Split SRB", "desc": "in MR-DC, a SRB between the MN and the UE with RLC bearers both\nin MCG and SCG.", "numbering": "3.1", "Keywords": "None"}, {"key": "DC", "desc": "Intra-E-UTRA Dual Connectivity", "numbering": "3.2", "Keywords": "None"}, {"key": "EN-DC", "desc": "E-UTRA-NR Dual Connectivity", "numbering": "3.2", "Keywords": "None"}, {"key": "MCG", "desc": "Master Cell Group", "numbering": "3.2", "Keywords": "None"}, {"key": "MN", "desc": "Master Node", "numbering": "3.2", "Keywords": "None"}, {"key": "MR-DC", "desc": "Multi-RAT Dual Connectivity", "numbering": "3.2", "Keywords": "None"}, {"key": "NE-DC", "desc": "NR-E-UTRA Dual Connectivity", "numbering": "3.2", "Keywords": "None"}, {"key": "NGEN-DC", "desc": "NG-RAN E-UTRA-NR Dual Connectivity", "numbering": "3.2", "Keywords": "None"}, {"key": "SCG", "desc": "Secondary Cell Group", "numbering": "3.2", "Keywords": "None"}, {"key": "SN", "desc": "Secondary Node", "numbering": "3.2", "Keywords": "None"}]